import React from "react";
import { Helmet } from "react-helmet-async";
import { Grid, Typography } from "@mui/material";

const AsasiLaw = () => {
  return (
    <>
      <Helmet>
        <title>قانون اساسی</title>
      </Helmet>
      <Grid
        container
        sx={{
          padding: "50px 0",
          display: "flex",
          justifyContent: "center",
          alignItems: "center",
        }}
      >
        <Grid
          container
          width={{ xs: "95%", sm: "90%", md: "80%" }}
          direction={"column"}
        >
          <Grid
            sx={{
              display: "flex",
              justifyContent: "center",
              alignItems: "center",
            }}
          >
            <Typography
              variant="h1"
              sx={{ fontSize: 40, fontFamily: "shabnam", color: "darkblue" }}
            >
              قانون اساسی
            </Typography>
          </Grid>
          <Typography
            variant="body1"
            sx={{ marginTop: "10px", fontFamily: "shabnam" }}
          >
            <Grid
              sx={{
                display: "flex",
                justifyContent: "center",
                alignItems: "center",
              }}
            >
              <Typography
                variant="h4"
                sx={{
                  fontSize: 20,
                  fontFamily: "shabnam",
                  marginTop: "20px",
                  color: "blue",
                }}
              >
                فصل اول - اصول کلی
              </Typography>
            </Grid>
            <div style={{ lineHeight: "2", textAlign: "justify" }}>
              اصل اول <br />
              حكومت ایران جمهوری اسلامی است كه ملت ایران، بر اساس اعتقاد
              دیرینه‏‌اش به حكومت حق و عدل قرآن، در پی انقلاب اسلامی پیروزمند
              خود به رهبری مرجع عالی‏قدر تقلید حضرت آیت‏ الله العظمی امام خمینی،
              در همه ‏پرسی دهم و یازدهم فروردین‏‌ماه یكهزار و سیصد و پنجاه و هشت
              هجری شمسی برابر با اول و دوم جمادی‏ الاولی سال یكهزار و سیصد و نود
              و نه هجری قمری با اكثریت ۹۸.۲% كلیه كسانی كه حق رأی داشتند، به آن
              رأی مثبت داد.
              <br />
              <br />
              اصل دوم
              <br />
              جمهوری اسلامی، نظامی است بر پایه ایمان به:
              <br />
              ۱- خدای یكتا (لا اله الا الله) و اختصاص حاكمیت و تشریع به او و
              لزوم تسلیم در برابر امر او؛
              <br />
              ۲- وحی الهی و نقش بنیادی آن در بیان قوانین؛
              <br />
              ۳- معاد و نقش سازنده آن در سیر تكاملی انسان به سوی خدا؛
              <br />
              ۴- عدل خدا در خلقت و تشریع؛
              <br />
              ۵- امامت و رهبری مستمر و نقش اساسی آن در تداوم انقلاب اسلام؛
              <br />
              ۶- كرامت و ارزش والای انسان و آزادی توأم با مسئولیت او در برابر
              خدا،
              <br />
              كه از راه‏:
              <br />
              الف - اجتهاد مستمر فقهای جامع‏ الشرایط بر اساس كتاب و سنت معصومین
              سلام ‏الله علیهم اجمعین؛
              <br />
              ب - استفاده از علوم و فنون و تجارب پیشرفته بشری و تلاش در پیشبرد
              آنها؛
              <br />
              ج - نفی هرگونه ستمگری و ستم ‏كشی و سلطه‏ گری و سلطه ‏پذیری،
              <br />
              قسط و عدل و استقلال سیاسی و اقتصادی و اجتماعی و فرهنگی و همبستگی
              ملی را تأمین می‏كند.
              <br />
              <br />
              اصل سوم
              <br />
              دولت جمهوری اسلامی ایران موظف است برای نیل به اهداف مذكور در اصل
              دوم، همه امكانات خود را برای امور زیر به كار برد:
              <br />
              ۱- ایجاد محیط مساعد برای رشد فضایل اخلاقی بر اساس ایمان و تقوی و
              مبارزه با كلیه مظاهر فساد و تباهی
              <br />
              ۲- بالابردن سطح آگاهی‏ های عمومی در همه زمینه‏ ها با استفاده صحیح
              از مطبوعات و رسانه ‏های گروهی و وسایل دیگر
              <br />
              ۳- آموزش و پرورش و تربیت بدنی رایگان برای همه در تمام سطوح و تسهیل
              و تعمیم آموزش عالی
              <br />
              ۴- تقویت روح بررسی و تتبع و ابتكار در تمام زمینه‏ های علمی، فنی،
              فرهنگی و اسلامی از طریق تأسیس مراكز تحقیق و تشویق محققان
              <br />
              ۵- طرد كامل استعمار و جلوگیری از نفوذ اجانب
              <br />
              ۶- محو هرگونه استبداد و خودكامگی و انحصارطلبی
              <br />
              ۷- تأمین آزادی‏های سیاسی و اجتماعی در حدود قانون
              <br />
              ۸- مشاركت عامه مردم در تعیین سرنوشت سیاسی، اقتصادی، اجتماعی و
              فرهنگی خویش
              <br />
              ۹- رفع تبعیضات ناروا و ایجاد امكانات عادلانه برای همه، در تمام
              زمینه‏‌های مادی و معنوی
              <br />
              ۱۰- ایجاد نظام اداری صحیح و حذف تشكیلات غیرضرور
              <br />
              ۱۱- تقویت كامل بنیه دفاع ملی از طریق آموزش نظامی عمومی برای حفظ
              استقلال و تمامیت ارضی و نظام اسلامی كشور
              <br />
              ۱۲- پی‏ریزی اقتصاد صحیح و عادلانه بر طبق ضوابط اسلامی جهت ایجاد
              رفاه و رفع فقر و برطرف ساختن هر نوع محرومیت در زمینه‌‏های تغذیه و
              مسكن و كار و بهداشت و تعمیم بیمه
              <br />
              ۱۳- تأمین خودكفایی در علوم و فنون و صنعت و كشاورزی و امور نظامی و
              مانند اینها
              <br />
              ۱۴- تأمین حقوق همه‏‌جانبه افراد از زن و مرد و ایجاد امنیت قضایی
              عادلانه برای همه و تساوی عموم در برابر قانون
              <br />
              ۱۵- توسعه و تحكیم برادری اسلامی و تعاون عمومی بین همه مردم
              <br />
              ۱۶- تنظیم سیاست خارجی كشور بر اساس معیارهای اسلام، تعهد برادرانه
              نسبت به همه مسلمان و حمایت بی‏دریغ از مستضعفان جهان.
              <br />
              <br />
              اصل چهارم
              <br />
              كلیه قوانین و مقررات مدنی، جزایی، مالی، اقتصادی، اداری، فرهنگی،
              نظامی، سیاسی و غیر اینها باید بر اساس موازین اسلامی باشد. این اصل
              بر اطلاق یا عموم همه اصول قانون اساسی و قوانین و مقررات دیگر حاكم
              است و تشخیص این امر بر عهده فقهای شورای نگهبان است.
              <br />
              <br />
              اصل پنجم
              <br />
              در زمان غیبت حضرت ولی عصر (عجل الله تعالی فرجه)، در جمهوری اسلامی
              ایران ولایت امر و امامت امت بر عهده فقیه عادل و با تقوی، آگاه به
              زمان، شجاع، مدیر و مدبر است كه طبق اصل یكصد و هفتم عهده‌‏دار آن
              می‏گردد.
              <br />
              <br />
              اصل ششم
              <br />
              در جمهوری اسلامی ایران امور كشور باید به اتكاء آراء عمومی اداره
              شود، از راه انتخابات: انتخاب رئیس جمهور، نمایندگان مجلس شورای
              اسلامی، اعضای شورا‏ها و نظایر اینها، یا از راه همه‌‏پرسی در مواردی
              كه در اصول دیگر این قانون معین می‏گردد.
              <br />
              <br />
              اصل هفتم
              <br />
              طبق دستور قرآن كریم: (وَ أمْرُهُمْ شُوری‏ بَینَهُم( و )شاوِرْهُمْ
              فِی الأمْرِ)، شوراها: مجلس شورای اسلامی، شورای استان، شهرستان،
              شهر، محل، بخش، روستا و نظایر اینها از اركان تصمیم ‏گیری و اداره
              امور كشورند. موارد، طرز تشكیل و حدود اختیارات و وظایف شورا‏ها را
              این قانون و قوانین ناشی از آن معین می‏كند.
              <br />
              <br />
              اصل هشتم
              <br />
              در جمهوری اسلامی ایران دعوت به خیر، امر به معروف و نهی از منكر
              وظیفه‏ای است همگانی و متقابل بر عهده مردم نسبت به یكدیگر، دولت
              نسبت به مردم و مردم نسبت به دولت. شرایط و حدود و كیفیت آن را قانون
              معین می‏كند. (وَ الْمُؤْمِنُونَ وَ الْمُؤْمِناتُ بَعْضُهُمْ
              أوْلِیاءُ بَعْضٍ یأمُرُونَ بِالْمَعْرُوفِ وَ ینْهَوْنَ عَنِ
              الْمُنْكَرِ).
              <br />
              <br />
              اصل نهم
              <br />
              در جمهوری اسلامی ایران، آزادی و استقلال و وحدت و تمامیت ارضی كشور
              از یكدیگر تفكیك‏ ناپذیرند و حفظ آنها وظیفه دولت و آحاد ملت است.
              هیچ فرد یا گروه یا مقامی حق ندارد به نام استفاده از آزادی، به
              استقلال سیاسی، فرهنگی، اقتصادی، نظامی و تمامیت ارضی ایران كمترین
              خدشه‏ای وارد كند و هیچ مقامی حق ندارد به نام حفظ استقلال و تمامیت
              ارضی كشور آزادی‏های مشروع را، هر چند با وضع قوانین و مقررات، سلب
              كند.
              <br />
              <br />
              اصل دهم
              <br />
              از آنجا كه خانواده واحد بنیادی جامعه اسلامی است، همه قوانین و
              مقررات و برنامه‏‌ریزی‏‌های مربوط باید در جهت آسان كردن تشكیل
              خانواده، پاسداری از قداست آن و استواری روابط خانوادگی بر پایه حقوق
              و اخلاق اسلامی باشد.
              <br />
              <br />
              اصل یازدهم
              <br />
              به حكم آیه كریمه: (إِنَّ هذِهِ اُمَّتُكُمْ اُمَّةً واحِدَةً وَ
              اَنَا رَبُّكُمْ فَاعْبُدُونِ)، همه مسلمانان یك اُمتند و دولت
              جمهوری اسلامی ایران موظف است سیاست كلی خود را بر پایه ائتلاف و
              اتحاد ملل اسلامی قرار دهد و كوشش پیگیر به عمل آورد تا وحدت سیاسی،
              اقتصادی و فرهنگی جهان اسلام را تحقق بخشد.
              <br />
              <br />
              اصل دوازدهم
              <br />
              دین رسمی ایران، اسلام و مذهب جعفری اثنی‏‌عشری است و این اصل الی‏
              الابد غیرقابل تغییر است و مذاهب دیگر اسلامی اعم از حنفی، شافعی،
              مالكی، حنبلی و زیدی دارای احترام كامل می‏باشند و پیروان این مذاهب
              در انجام مراسم مذهبی، طبق فقه خودشان آزادند و در تعلیم و تربیت
              دینی و احوال شخصیه (ازدواج، طلاق، ارث و وصیت) و دعاوی مربوط به آن
              در دادگاه‏ها رسمیت دارند و در هر منطقه‏‌ای كه پیروان هر یك از این
              مذاهب اكثریت داشته باشند، مقررات محلی در حدود اختیارات شورا‏ها بر
              طبق آن مذهب خواهد بود، با حفظ حقوق پیروان سایر مذاهب.
              <br />
              <br />
              اصل سیزدهم
              <br />
              ایرانیان زرتشتی، كلیمی و مسیحی تنها اقلیت‏های دینی شناخته می‏شوند
              كه در حدود قانون در انجام مراسم دینی خود آزادند و در احوال شخصیه و
              تعلیمات دینی بر طبق آیین خود عمل می‏كنند.
              <br />
              <br />
              اصل چهاردهم
              <br />
              به حكم آیه شریفه (لا ینْهاكُمُ اللهُ عَنِ الَّذینَ لَمْ
              یقاتِلُوكُمْ فِی الدِّینِ وَ لَمْ یخْرِجُوكُمْ مِنْ دِیارِكُمْ
              اَنْ تَبَرُّوهُمْ وَ تُقْسِطُوا إِلَیهِمْ إِنَّ اللهَ یحِبُّ
              الْمُقْسِطینَ) دولت جمهوری اسلامی ایران و مسلمانان موظفند نسبت به
              افراد غیرمسلمان با اخلاق حسنه و قسط و عدل اسلامی عمل نمایند و حقوق
              انسانی آنان را رعایت كنند. این اصل در حق كسانی اعتبار دارد كه بر
              ضد اسلام و جمهوری اسلامی ایران توطئه و اقدام نكنند.
              <br />
              <br />
              <br />
              <Grid
                sx={{
                  display: "flex",
                  justifyContent: "center",
                  alignItems: "center",
                }}
              >
                <Typography
                  variant="h4"
                  sx={{
                    fontSize: 20,
                    fontFamily: "shabnam",
                    marginTop: "20px",
                    color: "blue",
                  }}
                >
                  فصل دوم - زبان، خط، تاریخ و پرچم کشور
                </Typography>
              </Grid>
              <br />
              <br />
              اصل پانزدهم
              <br />
              زبان و خط رسمی و مشترك مردم ایران فارسی است. اسناد و مكاتبات و
              متون رسمی و كتب درسی باید با این زبان و خط باشد، ولی استفاده از
              زبان‏های محلی و قومی در مطبوعات و رسانه‏‌های گروهی و تدریس ادبیات
              آنها در مدارس، در كنار زبان فارسی آزاد است.
              <br />
              <br />
              اصل شانزدهم
              <br />
              از آنجا كه زبان قرآن و علوم و معارف اسلامی، عربی است و ادبیات
              فارسی كاملاً با آن آمیخته است، این زبان باید پس از دوره ابتدایی تا
              پایان دوره متوسطه در همه كلاس‏ها و در همه رشته‌‏‏ها تدریس شود.
              <br />
              <br />
              اصل هفدهم
              <br />
              مبدأ تاریخ رسمی كشور، هجرت پیامبر اسلام(ص) است و تاریخ هجری شمسی و
              هجری قمری هر دو معتبر است، اما مبنای كار ادارات دولتی هجری شمسی
              است. تعطیل رسمی هفتگی روز جمعه است.
              <br />
              <br />
              اصل هجدهم
              <br />
              پرچم رسمی ایران به رنگ‏های سبز و سفید و سرخ با علامت مخصوص جمهوری
              اسلامی و شعار «الله اكبر» است.
              <br />
              <br />
              <br />
              <Grid
                sx={{
                  display: "flex",
                  justifyContent: "center",
                  alignItems: "center",
                }}
              >
                <Typography
                  variant="h4"
                  sx={{
                    fontSize: 20,
                    fontFamily: "shabnam",
                    marginTop: "20px",
                    color: "blue",
                  }}
                >
                  فصل سوم - حقوق ملت
                </Typography>
              </Grid>
              <br />
              <br />
              اصل نوزدهم
              <br />
              مردم ایران از هر قوم و قبیله كه باشند از حقوق مساوی برخوردارند و
              رنگ، نژاد، زبان و مانند اینها سبب امتیاز نخواهد بود.
              <br />
              <br />
              اصل بیستم
              <br />
              همه افراد ملت اعم از زن و مرد، یكسان در حمایت قانون قرار دارند و
              از همه حقوق انسانی، سیاسی، اقتصادی، اجتماعی و فرهنگی با رعایت
              موازین اسلام برخوردارند.
              <br />
              <br />
              اصل بیست و یكم
              <br />
              دولت موظف است حقوق زن را در تمام جهات با رعایت موازین اسلامی تضمین
              نماید و امور زیر را انجام دهد:
              <br />
              ۱- ایجاد زمینه‏‌های مساعد برای رشد شخصیت زن و احیای حقوق مادی و
              معنوی او
              <br />
              ۲- حمایت مادران، بالخصوص در دوران بارداری و حضانت فرزند، و حمایت
              از كودكان بی‏‌سرپرست
              <br />
              ۳- ایجاد دادگاه صالح برای حفظ كیان و بقای خانواده
              <br />
              ۴- ایجاد بیمه خاص بیوگان و زنان سالخورده و بی‌سرپرست
              <br />
              ۵- اعطای قیمومت فرزندان به مادران شایسته در جهت غبطه آنها در صورت
              نبودن ولی شرعی.
              <br />
              <br />
              اصل بیست و دوم
              <br />
              حیثیت، جان، مال، حقوق، مسكن و شغل اشخاص از تعرض مصون است، مگر در
              مواردی كه قانون تجویز كند.
              <br />
              <br />
              اصل بیست و سوم
              <br />
              تفتیش عقاید ممنوع است و هیچ‏كس را نمی‏توان به صرف داشتن عقیده‏ای
              مورد تعرض و مؤاخذه قرار داد.
              <br />
              <br />
              اصل بیست و چهارم
              <br />
              نشریات و مطبوعات در بیان مطالب آزادند، مگر آنكه مخل به مبانی اسلام
              یا حقوق عمومی باشد. تفصیل آن را قانون معین می‏كند.
              <br />
              <br />
              اصل بیست و پنجم
              <br />
              بازرسی و نرساندن نامه‌‏ها، ضبط و فاش كردن مكالمات تلفنی، افشای
              مخابرات تلگرافی و تلكس، سانسور، عدم مخابره و نرساندن آنها، استراق
              سمع و هرگونه تجسس ممنوع است، مگر به حكم قانون.
              <br />
              <br />
              اصل بیست و ششم
              <br />
              احزاب، جمعیت‏ها، انجمن‏های سیاسی و صنفی و انجمن‏های اسلامی یا
              اقلیت‏های دینی شناخته‌‏شده آزادند، مشروط به اینكه اصول استقلال،
              آزادی، وحدت ملی، موازین اسلامی و اساس جمهوری اسلامی را نقض نكنند.
              هیچ‏كس را نمی‏توان از شركت در آنها منع كرد یا به شركت در یكی از
              آنها مجبور ساخت.
              <br />
              <br />
              اصل بیست و هفتم
              <br />
              تشكیل اجتماعات و راهپیمایی‏ها، بدون حمل سلاح، به شرط آنكه مخل به
              مبانی اسلام نباشد آزاد است.
              <br />
              <br />
              اصل بیست و هشتم
              <br />
              هر كس حق دارد شغلی را كه بدان مایل است و مخالف اسلام و مصالح عمومی
              و حقوق دیگران نیست برگزیند. دولت موظف است با رعایت نیاز جامعه به
              مشاغل گوناگون، برای همه افراد امكان اشتغال به كار و شرایط مساوی را
              برای احراز مشاغل ایجاد نماید.
              <br />
              <br />
              اصل بیست و نهم
              <br />
              برخورداری از تأمین اجتماعی از نظر بازنشستگی، بیكاری، پیری، از
              كارافتادگی، بی‏سرپرستی، در راه ماندگی، حوادث و سوانح، نیاز به
              خدمات بهداشتی و درمانی و مراقبت‏های پزشكی به صورت بیمه و غیره، حقی
              است همگانی. دولت مكلف است طبق قوانین از محل درآمدهای عمومی و
              درآمدهای حاصل از مشاركت مردم، خدمات و حمایت‏های مالی فوق را برای
              یك‌‏یك افراد كشور تأمین كند.
              <br />
              <br />
              اصل سی‌‏ام
              <br />
              دولت موظف است وسایل آموزش و پرورش رایگان را برای همه ملت تا پایان
              دوره متوسطه فراهم سازد و وسایل تحصیلات عالی را تا سر حد خودكفایی
              كشور به طور رایگان گسترش دهد.
              <br />
              <br />
              اصل سی و یكم
              <br />
              داشتن مسكن متناسب با نیاز، حق هر فرد و خانواده ایرانی است. دولت
              موظف است با رعایت اولویت برای آنها كه نیازمندترند به خصوص
              روستانشینان و كارگران، زمینه اجرای این اصل را فراهم كند.
              <br />
              <br />
              اصل سی و دوم
              <br />
              هیچ‏كس را نمی‏توان دستگیر كرد مگر به حكم و ترتیبی كه قانون معین
              می‏كند. در صورت بازداشت، موضوع اتهام باید با ذكر دلایل بلافاصله
              كتباً به متهم ابلاغ و تفهیم شود و حداكثر ظرف مدت بیست و چهار ساعت
              پرونده مقدماتی به مراجع صالحه قضایی ارسال و مقدمات محاكمه، در اسرع
              وقت فراهم گردد. متخلف از این اصل، طبق قانون مجازات می‏شود.
              <br />
              <br />
              اصل سی و سوم
              <br />
              هیچ‏كس را نمی‏توان از محل اقامت خود تبعید كرد یا از اقامت در محل
              مورد علاقه‏اش ممنوع یا به اقامت در محلی مجبور ساخت، مگر در مواردی
              كه قانون مقرر می‏دارد.
              <br />
              <br />
              اصل سی و چهارم
              <br />
              دادخواهی حق مسلّم هر فرد است و هر كس می‏تواند به منظور دادخواهی به
              دادگاه‏های صالح رجوع نماید. همه افراد ملت حق دارند اینگونه
              دادگاه‏ها را در دسترس داشته باشند و هیچ‏كس را نمی‏توان از دادگاهی
              كه به موجب قانون حق مراجعه به آن را دارد منع كرد.
              <br />
              <br />
              اصل سی و پنجم
              <br />
              در همه دادگاه‏ها طرفین دعوی حق دارند برای خود وكیل انتخاب نمایند و
              اگر توانایی انتخاب وكیل را نداشته باشند باید برای آنها امكانات
              تعیین وكیل فراهم گردد.
              <br />
              <br />
              اصل سی و ششم
              <br />
              حكم به مجازات و اجرای آن باید تنها از طریق دادگاه صالح و به موجب
              قانون باشد.
              <br />
              <br />
              اصل سی و هفتم
              <br />
              اصل، برائت است و هیچ‏كس از نظر قانون مجرم شناخته نمی‏شود، مگر
              اینكه جرم او در دادگاه صالح ثابت گردد.
              <br />
              <br />
              اصل سی و هشتم
              <br />
              هرگونه شكنجه برای گرفتن اقرار و یا كسب اطلاع ممنوع است. اجبار شخص
              به شهادت، اقرار یا سوگند، مجاز نیست و چنین شهادت و اقرار و سوگندی
              فاقد ارزش و اعتبار است. متخلف از این اصل، طبق قانون مجازات می‏شود.
              <br />
              <br />
              اصل سی و نهم
              <br />
              هتك حرمت و حیثیت كسی كه به حكم قانون دستگیر، بازداشت، زندانی یا
              تبعید شده، به هر صورت كه باشد ممنوع و موجب مجازات است.
              <br />
              <br />
              اصل چهلم
              <br />
              هیچ‏كس نمی‏تواند اِعمال حق خویش را وسیله اضرار به غیر یا تجاوز به
              منافع عمومی قرار دهد.
              <br />
              <br />
              اصل چهل و یكم
              <br />
              تابعیت كشور ایران حق مسلّم هر فرد ایرانی است و دولت نمی‏تواند از
              هیچ ایرانی سلب تابعیت كند، مگر به درخواست خود او یا در صورتی كه به
              تابعیت كشور دیگری درآید.
              <br />
              <br />
              اصل چهل و دوم
              <br />
              اتباع خارجه می‏توانند در حدود قوانین به تابعیت ایران درآیند و سلب
              تابعیت این‏گونه اشخاص در صورتی ممكن است كه دولت دیگری تابعیت آنها
              را بپذیرد یا خود آنها درخواست كنند.
              <br />
              <br />
              <br />
              <Grid
                sx={{
                  display: "flex",
                  justifyContent: "center",
                  alignItems: "center",
                }}
              >
                <Typography
                  variant="h4"
                  sx={{
                    fontSize: 20,
                    fontFamily: "shabnam",
                    marginTop: "20px",
                    color: "blue",
                  }}
                >
                  فصل چهارم - اقتصاد و امور مالی
                </Typography>
              </Grid>
              <br />
              <br />
              اصل چهل و سوم
              <br />
              برای تأمین استقلال اقتصادی جامعه و ریشه‏‌كن كردن فقر و محرومیت و
              برآوردن نیازهای انسان در جریان رشد، با حفظ آزادگی او، اقتصاد
              جمهوری اسلامی ایران بر اساس ضوابط زیر استوار می‏‌شود:
              <br />
              ۱- تأمین نیازهای اساسی: مسكن، خوراك، پوشاك، بهداشت، درمان، آموزش و
              پرورش و امكانات لازم برای تشكیل خانواده برای همه.
              <br />
              ۲- تأمین شرایط و امكانات كار برای همه به منظور رسیدن به اشتغال
              كامل و قرار دادن وسایل كار در اختیار همه كسانی كه قادر به كارند
              ولی وسایل كار ندارند، در شكل تعاونی، از راه وام بدون بهره یا هر
              راه مشروع دیگر كه نه به تمركز و تداول ثروت در دست افراد و گروه‏های
              خاص منتهی شود و نه دولت را به صورت یك كارفرمای بزرگ مطلق درآورد.
              این اقدام باید با رعایت ضرورت‏های حاكم بر برنامه‏‌ریزی عمومی
              اقتصاد كشور در هر یك از مراحل رشد صورت گیرد.
              <br />
              ۳- تنظیم برنامه اقتصادی كشور به صورتی كه شكل و محتوا و ساعات كار
              چنان باشد كه هر فرد علاوه بر تلاش شغلی‏، فرصت و توان كافی برای
              خودسازی معنوی، سیاسی و اجتماعی و شركت فعال در رهبری كشور و افزایش
              مهارت و ابتكار داشته باشد.
              <br />
              ۴- رعایت آزادی انتخاب شغل و عدم اجبار افراد به كاری معین و جلوگیری
              از بهره‌‏كشی از كار دیگری.
              <br />
              ۵- منع اضرار به غیر و انحصار و احتكار و ربا و دیگر معاملات باطل و
              حرام.
              <br />
              ۶- منع اسراف و تبذیر در همه شئون مربوط به اقتصاد، اعم از مصرف،
              سرمایه‌‏گذاری، تولید، توزیع و خدمات.
              <br />
              ۷- استفاده از علوم و فنون و تربیت افراد ماهر به نسبت احتیاج برای
              توسعه و پیشرفت اقتصاد كشور.
              <br />
              ۸- جلوگیری از سلطه اقتصادی بیگانه بر اقتصاد كشور.
              <br />
              ۹- تأكید بر افزایش تولیدات كشاورزی، دامی و صنعتی كه نیازهای عمومی
              را تأمین كند و كشور را به مرحله خودكفایی برساند و از وابستگی
              برهاند.
              <br />
              <br />
              اصل چهل و چهارم
              <br />
              نظام اقتصادی جمهوری اسلامی ایران بر پایه سه بخش دولتی، تعاونی و
              خصوصی با برنامهریزی منظم و صحیح استوار است.
              <br />
              بخش دولتی شامل كلیه صنایع بزرگ، صنایع مادر، بازرگانی خارجی، معادن
              بزرگ، بانكداری، بیمه، تأمین نیرو، سدها و شبكه‏‌های بزرگ آبرسانی،
              رادیو و تلویزیون، پست و تلگراف و تلفن، هواپیمایی، كشتیرانی، راه و
              راه آهن و مانند اینها است كه به صورت مالكیت عمومی و در اختیار دولت
              است.
              <br />
              بخش تعاونی شامل شركت‏ها و مؤسسات تعاونی تولید و توزیع است كه در
              شهر و روستا بر طبق ضوابط اسلامی تشكیل می‏شود.
              <br />
              بخش خصوصی شامل آن قسمت از كشاورزی، دامداری، صنعت، تجارت و خدمات
              می‏شود كه مكمل فعالیت‏های اقتصادی دولتی و تعاونی است.
              <br />
              مالكیت در این سه بخش تا جایی كه با اصول دیگر این فصل مطابق باشد و
              از محدوده قوانین اسلام خارج نشود و موجب رشد و توسعه اقتصادی كشور
              گردد و مایه زیان جامعه نشود مورد حمایت قانون جمهوری اسلامی است.
              <br />
              تفصیل ضوابط و قلمرو و شرایط هر سه بخش را قانون معین می‏كند.
              <br />
              <br />
              اصل چهل و پنجم
              <br />
              انفال و ثروت‏های عمومی از قبیل زمین‏های موات یا رها شده، معادن،
              دریاها، دریاچه‏‌ها، رودخانه‌‏ها و سایر آب‏های عمومی، كوه‏ها،
              دره‏ها‏، جنگل‏ها، نیزارها، بیشه‏های طبیعی، مراتعی كه حریم نیست،
              ارث بدون وارث و اموال مجهول‏ال‌مالك و اموال عمومی كه از غاصبین
              مسترد می‏شود، در اختیار حكومت اسلامی است تا بر طبق مصالح عامه نسبت
              به آنها عمل نماید. تفصیل و ترتیب استفاده از هر یك را قانون معین
              می‏كند.
              <br />
              <br />
              اصل چهل و ششم
              <br />
              هر كس مالك حاصل كسب و كار مشروع خویش است و هیچ‏كس نمی‏تواند به
              عنوان مالكیت نسبت به كسب و كار خود، امكان كسب و كار را از دیگری
              سلب كند.
              <br />
              <br />
              اصل چهل و هفتم
              <br />
              مالكیت شخصی كه از راه مشروع باشد محترم است. ضوابط آن را قانون معین
              می‏كند.
              <br />
              <br />
              اصل چهل و هشتم
              <br />
              در بهره‌‏برداری از منابع طبیعی و استفاده از درآمدهای ملی در سطح
              استان‏ها و توزیع فعالیت‏های اقتصادی میان استان‏ها و مناطق مختلف
              كشور، باید تبعیض در كار نباشد، به طوری كه هر منطقه فراخور نیاز‏ها
              و استعداد رشد خود، سرمایه و امكانات لازم در دسترس داشته باشد.
              <br />
              <br />
              اصل چهل و نهم
              <br />
              دولت موظف است ثروت‏های ناشی از ربا، غصب، رشوه، اختلاس، سرقت، قمار،
              سوء استفاده از موقوفات، سوء استفاده از مقاطعه‌‏كاری‏ها و معاملات
              دولتی، فروش زمین‏های موات و مباحات اصلی، دایر كردن اماكن فساد و
              سایر موارد غیرمشروع را گرفته و به صاحب حق رد كند و در صورت معلوم
              نبودن او به بیت‏المال بدهد. این حكم باید با رسیدگی و تحقیق و ثبوت
              شرعی به‏‌وسیله دولت اجرا شود.
              <br />
              <br />
              اصل پنجاهم
              <br />
              در جمهوری اسلامی، حفاظت محیط زیست كه نسل امروز و نسل‏های بعد باید
              در آن حیات اجتماعی رو به رشدی داشته باشند، وظیفه عمومی تلقی
              می‏گردد. از این رو فعالیت‏های اقتصادی و غیر آن كه با آلودگی محیط
              زیست یا تخریب غیرقابل جبران آن ملازمه پیدا كند، ممنوع است.
              <br />
              <br />
              اصل پنجاه و یكم
              <br />
              هیچ نوع مالیات وضع نمی‌‏شود مگر به موجب قانون. موارد معافیت و
              بخشودگی و تخفیف مالیاتی به موجب قانون مشخص می‏شود.
              <br />
              <br />
              اصل پنجاه و دوم
              <br />
              بودجه سالانه كل كشور به ترتیبی كه در قانون مقرر می‏شود از طرف دولت
              تهیه و برای رسیدگی و تصویب به مجلس شورای اسلامی تسلیم می‏گردد.
              هرگونه تغییر در ارقام بودجه نیز تابع مراتب مقرر در قانون خواهد
              بود.
              <br />
              <br />
              اصل پنجاه و سوم
              <br />
              كلیه دریافت‏های دولت در حساب‏های خزانه‌‏داری كل متمركز می‏شود و
              همه پرداخت‏ها در حدود اعتبارات مصوب به موجب قانون انجام می‏گیرد.
              <br />
              <br />
              اصل پنجاه و چهارم
              <br />
              دیوان محاسبات كشور مستقیماً زیر نظر مجلس شورای اسلامی می‏باشد.
              سازمان و اداره امور آن در تهران و مراكز استان‏ها به موجب قانون
              تعیین خواهد شد.
              <br />
              <br />
              اصل پنجاه و پنجم
              <br />
              دیوان محاسبات به كلیه حساب‏های وزارتخانه‏‌ها، مؤسسات، شركت‏های
              دولتی و سایر دستگاه‏هایی كه به نحوی از انحاء از بودجه كل كشور
              استفاده می‏‌كنند به ترتیبی كه قانون مقرر می‌‏دارد، رسیدگی یا
              حسابرسی می‏‌نماید كه هیچ هزینه‏‌ای از اعتبارات مصوب تجاوز نكرده و
              هر وجهی در محل خود به مصرف رسیده باشد. دیوان محاسبات، حساب‏ها و
              اسناد و مدارك مربوطه را برابر قانون، جمع‏ آوری و گزارش تفریغ بودجه
              هر سال را به انضمام نظرات خود به مجلس شورای اسلامی تسلیم
              می‏‌نماید. این گزارش باید در دسترس عموم گذاشته شود.
              <br />
              <br />
              <br />
              <Grid
                sx={{
                  display: "flex",
                  justifyContent: "center",
                  alignItems: "center",
                }}
              >
                <Typography
                  variant="h4"
                  sx={{
                    fontSize: 20,
                    fontFamily: "shabnam",
                    marginTop: "20px",
                    color: "blue",
                  }}
                >
                  فصل پنجم - حق حاکمیت ملت و قوای ناشی از آن
                </Typography>
              </Grid>
              <br />
              <br />
              اصل پنجاه و ششم
              <br />
              حاكمیت مطلق بر جهان و انسان از آن خداست و هم او، انسان را بر
              سرنوشت اجتماعی خویش حاكم ساخته است. هیچ‏كس نمی‏تواند این حق الهی
              را از انسان سلب كند یا در خدمت منافع فرد یا گروهی خاص قرار دهد و
              ملت این حق خداداد را از طرقی كه در اصول بعد می‏آید اِعمال می‏‌كند.
              <br />
              <br />
              اصل پنجاه و هفتم
              <br />
              قوای حاكم در جمهوری اسلامی ایران عبارتند از: قوه مقننه، قوه مجریه
              و قوه قضائیه كه زیر نظر ولایت مطلقه امر و امامت امت بر طبق اصول
              آینده این قانون اعمال می‏گردند. این قوا مستقل از یكدیگرند.
              <br />
              <br />
              اصل پنجاه و هشتم
              <br />
              اعمال قوه مقننه از طریق مجلس شورای اسلامی است كه از نمایندگان
              منتخب مردم تشكیل می‏شود و مصوبات آن پس از طی مراحلی كه در اصول بعد
              می‏آید برای اجرا به قوه مجریه و قضائیه ابلاغ می‏‌گردد.
              <br />
              <br />
              اصل پنجاه و نهم
              <br />
              در مسائل بسیار مهم اقتصادی، سیاسی، اجتماعی و فرهنگی ممكن است اعمال
              قوه مقننه از راه همه‌‏پرسی و مراجعه مستقیم به آراء مردم صورت گیرد.
              درخواست مراجعه به آراء عمومی باید به تصویب دو سوم مجموع نمایندگان
              مجلس برسد.
              <br />
              <br />
              اصل شصتم
              <br />
              اعمال قوه مجریه جز در اموری كه در این قانون مستقیماً بر عهده رهبری
              گذارده شده، از طریق ‏رئیس جمهور و وزرا است.
              <br />
              <br />
              اصل شصت و یکم
              <br />
              اِعمال قوه قضائیه به وسیله دادگاه‏های دادگستری است كه باید طبق
              موازین اسلامی تشكیل شود و به حل و فصل دعاوی و حفظ حقوق عمومی و
              گسترش و اجرای عدالت و اقامه حدود الهی بپردازد.
              <br />
              <br />
              <br />
              <Grid
                sx={{
                  display: "flex",
                  justifyContent: "center",
                  alignItems: "center",
                }}
              >
                <Typography
                  variant="h4"
                  sx={{
                    fontSize: 20,
                    fontFamily: "shabnam",
                    marginTop: "20px",
                    color: "blue",
                  }}
                >
                  فصل ششم - قوه مقننه
                </Typography>
              </Grid>
              <br />
              <br />
              مبحث اول- مجلس شورای اسلامی
              <br />
              <br />
              اصل شصت و دوم
              <br />
              مجلس شورای اسلامی از نمایندگان ملت كه به طور مستقیم و با رأی مخفی
              انتخاب می‏شوند تشكیل می‏گردد. شرایط انتخاب‏ كنندگان و انتخاب‏
              شوندگان و كیفیت انتخابات را قانون معین خواهد كرد.
              <br />
              <br />
              اصل شصت و سوم
              <br />
              دوره نمایندگی مجلس شورای اسلامی چهار سال است. انتخابات هر دوره
              باید پیش از پایان دوره قبل برگزار شود به طوری كه كشور در هیچ ‏زمان
              بدون مجلس نباشد.
              <br />
              <br />
              اصل شصت و چهارم
              <br />
              عده نمایندگان مجلس شورای اسلامی دویست و هفتاد نفر است و از تاریخ
              همه‏ پرسی سال یكهزار و سیصد و شصت و هشت هجری شمسی پس از هر ده سال،
              با در نظر گرفتن عوامل انسانی، سیاسی، جغرافیایی و نظایر آنها حداكثر
              بیست نفر نماینده می‌‏تواند اضافه شود. زرتشتیان و كلیمیان هركدام یك
              نماینده و مسیحیان آشوری و كلدانی مجموعاً یك نماینده و مسیحیان
              ارمنی جنوب و شمال هركدام یك نماینده انتخاب می‏كنند. محدوده
              حوزه‌‏های انتخابیه و تعداد نمایندگان را قانون معین می‏كند.
              <br />
              <br />
              اصل شصت و پنجم
              <br />
              پس از برگزاری انتخابات، جلسات مجلس شورای اسلامی با حضور دو سوم
              مجموع نمایندگان رسمیت می‏یابد و تصویب طرح‏ها و لوایح طبق
              آیین‌‏نامه مصوب داخلی انجام می‌‏گیرد، مگر در مواردی كه در قانون
              اساسی نصاب خاصی تعیین شده باشد. برای تصویب آیین‏نامه داخلی موافقت
              دو سوم حاضران لازم است.
              <br />
              <br />
              اصل شصت و ششم
              <br />
              ترتیب انتخاب رئیس و هیئت رئیسه مجلس و تعداد كمیسیون‏ها و دوره تصدی
              آنها و امور مربوط به مذاكرات و انتظامات مجلس به‏‌وسیله آیین‏‌نامه
              داخلی مجلس معین می‏گردد.
              <br />
              <br />
              اصل شصت و هفتم
              <br />
              نمایندگان باید در نخستین جلسه مجلس به ترتیب زیر سوگند یاد كنند و
              متن قسم‏‌نامه را امضاء نمایند:
              <br />
              <br />
              بسم الله الرحمن الرحیم
              <br />
              «من در برابر قرآن مجید، به خدای قادر متعال سوگند یاد می‏‌كنم و با
              تكیه بر شرف انسانی خویش تعهد می‏‌نمایم كه پاسدار حریم اسلام و
              نگاهبان دستاوردهای انقلاب اسلامی ملت ایران و مبانی جمهوری اسلامی
              باشم، ودیعه‌‏ای را كه ملت به ما سپرده به عنوان امینی عادل پاسداری
              كنم و در انجام وظایف وكالت، امانت و تقوا را رعایت نمایم و همواره
              به استقلال و اعتلای كشور و حفظ حقوق ملت و خدمت به مردم پایبند
              باشم، از قانون اساسی دفاع كنم و در گفته‏‌ها و نوشته‏‌ها و
              اظهارنظرها، استقلال كشور و آزادی مردم و تأمین مصالح آنها را مدنظر
              داشته باشم.»
              <br />
              نمایندگان اقلیت‏های دینی این سوگند را با ذكر كتاب آسمانی خود یاد
              خواهند كرد.
              <br />
              نمایندگانی كه در جلسه نخست شركت ندارند باید در اولین جلسه‏ای كه
              حضور پیدا می‏كنند مراسم سوگند را به‏‌جای آورند.
              <br />
              <br />
              اصل شصت و هشتم
              <br />
              در زمان جنگ و اشغال نظامی كشور به پیشنهاد رئیس جمهور و تصویب سه
              چهارم مجموع نمایندگان و تأیید شورای نگهبان انتخابات نقاط اشغال شده
              یا تمامی مملكت برای مدت معینی متوقف می‏شود و در صورت عدم تشكیل
              مجلس جدید، مجلس سابق همچنان به كار خود ادامه خواهد داد.
              <br />
              <br />
              اصل شصت و نهم
              <br />
              مذاكرات مجلس شورای اسلامی باید علنی باشد و گزارش كامل آن از طریق
              رادیو و روزنامه رسمی برای اطلاع عموم منتشر شود. در شرایط اضطراری،
              در صورتی كه رعایت امنیت كشور ایجاب كند، به تقاضای رئیس جمهور یا
              یكی از وزرا یا ده نفر از نمایندگان، جلسه غیرعلنی تشكیل می‏شود.
              مصوبات جلسه غیرعلنی در صورتی معتبر است كه با حضور شورای نگهبان به
              تصویب سه چهارم مجموع نمایندگان برسد. گزارش و مصوبات این جلسات باید
              پس از بر طرف شدن شرایط اضطراری برای اطلاع عموم منتشر گردد.
              <br />
              <br />
              اصل هفتادم
              <br />
              رئیس جمهور و معاونان او و وزیران به اجتماع یا به انفراد حق شركت در
              جلسات علنی مجلس را دارند و می‏توانند مشاوران خود را همراه داشته
              باشند و در صورتی كه نمایندگان لازم بدانند، وزرا مكلف به حضورند و
              هرگاه تقاضا كنند مطالبشان استماع می‏شود.
              <br />
              مبحث دوم- اختیارات و صلاحیت مجلس شورای اسلامی
              <br />
              <br />
              اصل هفتاد و یكم
              <br />
              مجلس شورای اسلامی در عموم مسائل در حدود مقرر در قانون اساسی
              می‏تواند قانون وضع كند.
              <br />
              <br />
              اصل هفتاد و دوم
              <br />
              مجلس شورای اسلامی نمی‏تواند قوانینی وضع كند كه با اصول و احكام
              مذهب رسمی كشور یا قانون اساسی مغایرت داشته باشد. تشخیص این امر به
              ترتیبی كه در اصل نود و ششم آمده بر عهده شورای نگهبان است.
              <br />
              <br />
              اصل هفتاد و سوم
              <br />
              شرح و تفسیر قوانین عادی در صلاحیت مجلس شورای اسلامی است. مفاد این
              اصل مانع از تفسیری كه دادرسان، در مقام تمیز حق از قوانین می‏‌كنند
              نیست.
              <br />
              <br />
              اصل هفتاد و چهارم
              <br />
              لوایح قانونی پس از تصویب هیئت وزیران به مجلس تقدیم می‏‌شود و
              طرح‏های قانونی به پیشنهاد حداقل پانزده نفر از نمایندگان، در مجلس
              شورای اسلامی قابل طرح است.
              <br />
              <br />
              اصل هفتاد و پنجم
              <br />
              طرح‏های قانونی و پیشنهاد‏ها و اصلاحاتی كه نمایندگان در خصوص لوایح
              قانونی عنوان می‏كنند و به تقلیل درآمد عمومی یا افزایش هزینه عمومی
              می‏انجامد، در صورتی قابل طرح در مجلس است كه در آن طریق جبران كاهش
              درآمد یا تأمین هزینه جدید نیز معلوم شده باشد.
              <br />
              <br />
              اصل هفتاد و ششم
              <br />
              مجلس شورای اسلامی حق تحقیق و تفحص در تمام امور كشور را دارد.
              <br />
              <br />
              اصل هفتاد و هفتم
              <br />
              عهدنامه‏‌ها، مقاوله‌‏نامه‏‌ها، قرارداد‏ها و موافقت‌نامه‌‏های
              بین‏‌المللی باید به تصویب مجلس شورای اسلامی برسد.
              <br />
              <br />
              اصل هفتاد و هشتم
              <br />
              هرگونه تغییر در خطوط مرزی ممنوع است مگر اصلاحات جزئی با رعایت
              مصالح كشور، به شرط اینكه یك‏طرفه نباشد و به استقلال و تمامیت ارضی
              كشور لطمه نزند و به تصویب چهارپنجم مجموع نمایندگان مجلس شورای
              اسلامی برسد.
              <br />
              <br />
              اصل هفتاد و نهم
              <br />
              برقراری حكومت نظامی ممنوع است. در حالت جنگ و شرایط اضطراری نظیر
              آن، دولت حق دارد با تصویب مجلس شورای اسلامی موقتاً محدودیت‏های
              ضروری را برقرار نماید، ولی مدت آن به هر حال نمی‏تواند بیش از سی
              روز باشد و در صورتی كه ضرورت همچنان باقی باشد دولت موظف است مجدداً
              از مجلس كسب مجوز كند.
              <br />
              <br />
              اصل هشتادم
              <br />
              گرفتن و دادن وام یا كمك‏های بدون عوض داخلی و خارجی از طرف دولت
              باید با تصویب مجلس شورای اسلامی باشد.
              <br />
              <br />
              اصل هشتاد و یكم
              <br />
              دادن امتیاز تشكیل شركت‏ها و مؤسسات در امور تجارتی و صنعتی و
              كشاورزی و معادن و خدمات به خارجیان مطلقاً ممنوع است.
              <br />
              <br />
              اصل هشتاد و دوم
              <br />
              استخدام كارشناسان خارجی از طرف دولت ممنوع است، مگر در موارد ضرورت
              با تصویب مجلس شورای اسلامی.
              <br />
              <br />
              اصل هشتاد و سوم
              <br />
              بنا‏ها و اموال دولتی كه از نفایس ملی باشد قابل انتقال به غیر نیست
              مگر با تصویب مجلس شورای اسلامی، آن هم در صورتی كه از نفایس منحصر
              به فرد نباشد.
              <br />
              <br />
              اصل هشتاد و چهارم
              <br />
              هر نماینده در برابر تمام ملت مسئول است و حق دارد در همه مسائل
              داخلی و خارجی كشور اظهار نظر نماید.
              <br />
              <br />
              اصل هشتاد و پنجم
              <br />
              سِمَت نمایندگی قائم به شخص است و قابل واگذاری به دیگری نیست. مجلس
              نمی‏تواند اختیار قانون‏گذاری را به شخص یا هیئتی واگذار كند ولی در
              موارد ضروری می‏تواند اختیار وضع بعضی از قوانین را با رعایت اصل
              هفتاد و دوم به كمیسیون‏های داخلی خود تفویض كند. در این صورت این
              قوانین در مدتی كه مجلس تعیین می‏نماید به صورت آزمایشی اجرا می‏شود
              و تصویب نهایی آنها با مجلس خواهد بود. همچنین مجلس شورای اسلامی
              می‏تواند تصویب دائمی اساسنامه سازمان‏ها، شركت‏ها، مؤسسات دولتی یا
              وابسته به دولت را با رعایت اصل هفتاد و دوم به كمیسیون‏های ذی‏ربط
              واگذار كند و یا اجازه تصویب آنها را به دولت بدهد. در این صورت
              مصوبات دولت نباید با اصول و احكام مذهب رسمی كشور و یا قانون اساسی
              مغایرت داشته باشد. تشخیص این امر به ترتیب مذكور در اصل نود و ششم
              با شورای نگهبان است. علاوه بر این، مصوبات دولت نباید مخالف قوانین
              و مقررات عمومی كشور باشد و به منظور بررسی و اعلام عدم مغایرت آنها
              با قوانین مزبور باید ضمن ابلاغ برای اجرا به اطلاع رئیس مجلس شورای
              اسلامی برسد.
              <br />
              <br />
              اصل هشتاد و ششم
              <br />
              نمایندگان مجلس در مقام ایفای وظایف نمایندگی در اظهار نظر و رأی خود
              كاملاً آزادند و نمی‏توان آنها را به سبب نظراتی كه در مجلس اظهار
              كرده‏اند یا آرایی كه در مقام ایفای وظایف نمایندگی خود داده‏اند
              تعقیب یا توقیف كرد.
              <br />
              <br />
              اصل هشتاد و هفتم
              <br />
              رئیس جمهور برای هیئت وزیران پس از تشكیل و پیش از هر اقدام دیگر
              باید از مجلس رأی اعتماد بگیرد. در دوران تصدی نیز در مورد مسائل مهم
              و مورد اختلاف می‏تواند از مجلس برای هیئت وزیران تقاضای رأی اعتماد
              كند.
              <br />
              <br />
              اصل هشتاد و هشتم
              <br />
              در هر مورد كه حداقل یك چهارم كل نمایندگان مجلس شورای اسلامی از
              رئیس جمهور و یا هر یك از نمایندگان از وزیر مسئول، درباره یكی از
              وظایف آنان سؤال كنند، رئیس جمهور یا وزیر موظف است در مجلس حاضر شود
              و به سؤال جواب دهد و این جواب نباید در مورد رئیس جمهور بیش از یك
              ماه و در مورد وزیر بیش از ده روز به تأخیر افتد مگر با عذر موجه به
              تشخیص مجلس شورای اسلامی.
              <br />
              <br />
              اصل هشتاد و نهم
              <br />
              ۱- نمایندگان مجلس شورای اسلامی می‏توانند در مواردی كه لازم
              می‏دانند هیئت وزیران یا هر یك از وزرا را استیضاح كنند. استیضاح
              وقتی قابل طرح در مجلس است كه با امضای حداقل ده نفر از نمایندگان به
              مجلس تقدیم شود. هیئت وزیران یا وزیر مورد استیضاح باید ظرف مدت ده
              روز پس از طرح آن در مجلس حاضر شود و به آن پاسخ گوید و از مجلس رأی
              اعتماد بخواهد. در صورت عدم حضور هیئت وزیران یا وزیر برای پاسخ،
              نمایندگان مزبور درباره استیضاح خود توضیحات لازم را می‏دهند و در
              صورتی كه مجلس مقتضی بداند اعلام رأی عدم اعتماد خواهد كرد. اگر مجلس
              رأی اعتماد نداد هیئت وزیران یا وزیر مورد استیضاح عزل می‏شود. در هر
              دو صورت وزرای مورد استیضاح نمی‏توانند در هیئت وزیرانی كه بلافاصله
              بعد از آن تشكیل می‏شود عضویت پیدا كنند.
              <br />
              ۲- در صورتی كه حداقل یك سوم از نمایندگان مجلس شورای اسلامی رئیس
              جمهور را در مقام اجرای وظایف مدیریت قوه مجریه و اداره امور اجرایی
              كشور مورد استیضاح قرار دهند، رئیس جمهور باید ظرف مدت یك ماه پس از
              طرح آن در مجلس حاضر شود و در خصوص مسائل مطرح‏شده توضیحات كافی
              بدهد. در صورتی كه پس از بیانات نمایندگان مخالف و موافق و پاسخ رئیس
              جمهور، اكثریت دو سوم كل نمایندگان به عدم كفایت رئیس جمهور رأی
              دادند مراتب جهت اجرای بند ده اصل یكصد و دهم به اطلاع مقام رهبری
              می‏رسد.
              <br />
              <br />
              اصل نودم
              <br />
              هر كس شكایتی از طرز كار مجلس یا قوه مجریه یا قوه قضائیه داشته
              باشد، می‏تواند شكایت خود را كتباً به مجلس شورای اسلامی عرضه كند.
              مجلس موظف است به این شكایات رسیدگی كند و پاسخ كافی دهد و در مواردی
              كه شكایت به قوه مجریه و یا قوه قضائیه مربوط است رسیدگی و پاسخ كافی
              از آنها بخواهد و در مدت متناسب نتیجه را اعلام نماید و در موردی كه
              مربوط به عموم باشد به اطلاع عامه برساند.
              <br />
              <br />
              اصل نود و یكم
              <br />
              به منظور پاسداری از احكام اسلام و قانون اساسی از نظر عدم مغایرت
              مصوبات مجلس شورای اسلامی با آنها، شورایی به نام شورای نگهبان با
              تركیب زیر تشكیل می‏شود:
              <br />
              ۱- شش نفر از فقهای عادل و آگاه به مقتضیات زمان و مسائل روز. انتخاب
              این عده با مقام رهبری است.
              <br />
              ۲- شش نفر حقوقدان، در رشته‏‌های مختلف حقوقی، از میان حقوقدانان
              مسلمانی كه به‏‌وسیله رئیس قوه قضائیه به مجلس شورای اسلامی معرفی
              می‏‌شوند و با رأی مجلس انتخاب می‏گردند.
              <br />
              <br />
              اصل نود و دوم
              <br />
              اعضای شورای نگهبان برای مدت شش سال انتخاب می‏شوند ولی در نخستین
              دوره پس از گذشتن سه سال، نیمی از اعضای هر گروه به قید قرعه تغییر
              می‏یابند و اعضای تازه‏ای به جای آنها انتخاب می‏شوند.
              <br />
              <br />
              اصل نود و سوم
              <br />
              مجلس شورای اسلامی بدون وجود شورای نگهبان اعتبار قانونی ندارد مگر
              در مورد تصویب اعتبارنامه نمایندگان و انتخاب شش نفر حقوقدان اعضای
              شورای نگهبان.
              <br />
              <br />
              اصل نود و چهارم
              <br />
              كلیه مصوبات مجلس شورای اسلامی باید به شورای نگهبان فرستاده شود.
              شورای نگهبان موظف است آن را حداكثر ظرف ده روز از تاریخ وصول از نظر
              انطباق بر موازین اسلام و قانون اساسی مورد بررسی قرار دهد و چنانچه
              آن را مغایر ببیند برای تجدیدنظر به مجلس بازگرداند. در غیر این صورت
              مصوبه قابل اجرا است.
              <br />
              <br />
              اصل نود و پنجم
              <br />
              در مواردی كه شورای نگبهان مدت ده روز را برای رسیدگی و اظهار نظر
              نهایی كافی نداند، می‏تواند از مجلس شورای اسلامی حداكثر برای ده روز
              دیگر با ذكر دلیل خواستار تمدید وقت شود.
              <br />
              <br />
              اصل نود و ششم
              <br />
              تشخیص عدم مغایرت مصوبات مجلس شورای اسلامی با احكام اسلام با اكثریت
              فقهای شورای نگهبان و تشخیص عدم تعارض آنها با قانون اساسی بر عهده
              اكثریت همه اعضای شورای نگهبان است.
              <br />
              <br />
              اصل نود و هفتم
              <br />
              اعضای شورای نگهبان به منظور تسریع در كار می‏‌توانند هنگام مذاكره
              درباره لایحه یا طرح قانونی در مجلس حاضر شوند و مذاكرات را استماع
              كنند. اما وقتی طرح یا لایحه‏‌ای فوری در دستور كار مجلس قرار گیرد،
              اعضای شورای نگهبان باید در مجلس حاضر شوند و نظر خود را اظهار
              نمایند.
              <br />
              <br />
              اصل نود و هشتم
              <br />
              تفسیر قانون اساسی به عهده شورای نگهبان است كه با تصویب سه چهارم
              آنان انجام می‏‌شود.
              <br />
              <br />
              اصل نود و نهم
              <br />
              شورای نگهبان نظارت بر انتخابات مجلس خبرگان رهبری، ریاست جمهوری،
              مجلس شورای اسلامی و مراجعه به آراء عمومی و همه‌‏پرسی را بر عهده
              دارد.
              <br />
              <br />
              <br />
              <Grid
                sx={{
                  display: "flex",
                  justifyContent: "center",
                  alignItems: "center",
                }}
              >
                <Typography
                  variant="h4"
                  sx={{
                    fontSize: 20,
                    fontFamily: "shabnam",
                    marginTop: "20px",
                    color: "blue",
                  }}
                >
                  فصل هفتم - شوراها
                </Typography>
              </Grid>
              <br />
              <br />
              اصل یكصدم
              <br />
              برای پیشبرد سریع برنامه‏‌های اجتماعی، اقتصادی، عمرانی، بهداشتی،
              فرهنگی، آموزشی و سایر امور رفاهی از طریق همكاری مردم با توجه به
              مقتضیات محلی، اداره امور هر روستا، بخش، شهر، شهرستان یا استان با
              نظارت شورایی به نام شورای ده، بخش، شهر، شهرستان یا استان صورت
              می‏گیرد كه اعضای آن را مردم همان محل انتخاب می‏كنند. شرایط انتخاب‏
              كنندگان و انتخاب ‏شوندگان و حدود وظایف و اختیارات و نحوه انتخاب و
              نظارت شوراهای مذكور و سلسله مراتب آنها را كه باید با رعایت اصول
              وحدت ملی و تمامیت ارضی و نظام جمهوری اسلامی و تابعیت حكومت مركزی
              باشد قانون معین می‏كند.
              <br />
              <br />
              اصل یكصد و یكم
              <br />
              به منظور جلوگیری از تبعیض و جلب همكاری در تهیه برنامه‏‌های عمرانی
              و رفاهی استان‏ها و نظارت بر اجرای هماهنگ آنها، شورای عالی استان‏ها
              مركب از نمایندگان شوراهای استان‏ها تشكیل می‏‌شود. نحوه تشكیل و
              وظایف این شورا را قانون معین می‌‏كند.
              <br />
              <br />
              اصل یكصد و دوم
              <br />
              شورای عالی استان‏ها حق دارد در حدود وظایف خود طرح‏هایی تهیه و
              مستقیماً یا از طریق دولت به مجلس شورای اسلامی پیشنهاد كند. این
              طرح‏ها باید در مجلس مورد بررسی قرار گیرد.
              <br />
              <br />
              اصل یكصد و سوم
              <br />
              استانداران، فرمانداران، بخشداران و سایر مقامات كشوری كه از طرف
              دولت تعیین می‏شوند، در حدود اختیارات شورا‏ها ملزم به رعایت تصمیمات
              آنها هستند.
              <br />
              <br />
              اصل یكصد و چهارم
              <br />
              به منظور تأمین قسط اسلامی و همكاری در تهیه برنامه‏‌ها و ایجاد
              هماهنگی در پیشرفت امور در واحدهای تولیدی، صنعتی و كشاورزی،
              شوراهایی مركب از نمایندگان كارگران و دهقانان و دیگر كاركنان و
              مدیران، و در واحدهای آموزشی، اداری، خدماتی و مانند اینها شوراهایی
              مركب از نمایندگان اعضای این واحد‏ها تشكیل می‏شود. چگونگی تشكیل این
              شورا‏ها و حدود وظایف و اختیارات آنها را قانون معین می‏كند.
              <br />
              <br />
              اصل یكصد و پنجم
              <br />
              تصمیمات شورا‏ها نباید مخالف موازین اسلام و قوانین كشور باشد.
              <br />
              <br />
              اصل یكصد و ششم
              <br />
              انحلال شورا‏ها جز در صورت انحراف از وظایف قانونی ممكن نیست. مرجع
              تشخیص انحراف و ترتیب انحلال شورا‏ها و طرز تشكیل مجدد آنها را قانون
              معین می‏كند. شورا در صورت اعتراض به انحلال حق دارد به دادگاه صالح
              شكایت كند و دادگاه موظف است خارج از نوبت به آن رسیدگی كند.
              <br />
              <br />
              <br />
              <Grid
                sx={{
                  display: "flex",
                  justifyContent: "center",
                  alignItems: "center",
                }}
              >
                <Typography
                  variant="h4"
                  sx={{
                    fontSize: 20,
                    fontFamily: "shabnam",
                    marginTop: "20px",
                    color: "blue",
                  }}
                >
                  فصل هشتم - رهبر یا شورای رهبری
                </Typography>
              </Grid>
              <br />
              <br />
              اصل یكصد و هفتم
              <br />
              پس از مرجع عالی‏قدر تقلید و رهبر كبیر انقلاب جهانی اسلام و
              بنیان‏گذار جمهوری اسلامی ایران حضرت آیت‌الله‌العظمی امام خمینی
              «قدس سره ‏الشریف» كه از طرف اكثریت قاطع مردم به مرجعیت و رهبری
              شناخته و پذیرفته شدند، تعیین رهبر به عهده خبرگان منتخب مردم است.
              خبرگان رهبری درباره همه فقهای واجد شرایط مذكور در اصول پنجم و یكصد
              و نهم بررسی و مشورت می‏‌كنند. هرگاه یكی از آنان را اعلم به احكام و
              موضوعات فقهی یا مسائل سیاسی و اجتماعی یا دارای مقبولیت عامه یا
              واجد برجستگی خاص در یكی از صفات مذكور در اصل یكصد و نهم تشخیص دهند
              او را به رهبری انتخاب می‏‌كنند و در غیر این صورت یكی از آنان را به
              عنوان رهبر انتخاب و معرفی می‏‌نمایند. رهبر منتخب خبرگان، ولایت امر
              و همه مسئولیت‏های ناشی از آن را بر عهده خواهد داشت. رهبر در برابر
              قوانین با سایر افراد كشور مساوی است.
              <br />
              <br />
              اصل یكصد و هشتم
              <br />
              قانون مربوط به تعداد و شرایط خبرگان، كیفیت انتخاب آنها و
              آیین‌‏نامه داخلی جلسات آنان برای نخستین دوره باید به‌‏وسیله فقهای
              اولین شورای نگهبان تهیه و با اكثریت آرای آنان تصویب شود و به تصویب
              نهایی رهبر انقلاب برسد. از آن پس هرگونه تغییر و تجدیدنظر در این
              قانون و تصویب سایر مقررات مربوط به وظایف خبرگان، در صلاحیت خود
              آنان است.
              <br />
              <br />
              اصل یكصد و نهم
              <br />
              شرایط و صفات رهبر:
              <br />
              ۱- صلاحیت علمی لازم برای افتاء در ابواب مختلف فقه
              <br />
              ۲- عدالت و تقوای لازم برای رهبری امت اسلام
              <br />
              ۳- بینش صحیح سیاسی و اجتماعی، تدبیر، شجاعت، مدیریت و قدرت كافی
              برای رهبری.
              <br />
              در صورت تعدد واجدین شرایط فوق، شخصی كه دارای بینش فقهی و سیاسی
              قوی‏تر باشد مقدم است.
              <br />
              <br />
              اصل یكصد و دهم
              <br />
              وظایف و اختیارات رهبر:
              <br />
              ۱- تعیین سیاست‏های كلّی نظام جمهوری اسلامی ایران پس از مشورت با
              مجمع تشخیص مصلحت نظام
              <br />
              ۲- نظارت بر حُسن اجرای سیاست‏های كلّی نظام
              <br />
              ۳- فرمان همه‌‏پرسی
              <br />
              ۴- فرماندهی كل نیروهای مسلح
              <br />
              ۵- اعلان جنگ و صلح و بسیج نیروها
              <br />
              ۶- نصب و عزل و قبول استعفا‏ء:
              <br />
              الف- فقهای شورای نگهبان
              <br />
              ب- عالی‏ترین مقام قوه قضائیه
              <br />
              ج- رئیس سازمان صدا و سیمای جمهوری اسلامی ایران
              <br />
              د- رئیس ستاد مشترك
              <br />
              ه‍- فرمانده كل سپاه پاسداران انقلاب اسلامی
              <br />
              و- فرماندهان عالی نیروهای نظامی و انتظامی
              <br />
              ۷- حل اختلاف و تنظیم روابط قوای سه‏‌گانه
              <br />
              ۸- حل معضلات نظام كه از طُرُق عادی قابل حل نیست، از طریق مجمع
              تشخیص مصلحت نظام
              <br />
              ۹- امضاء حكم ریاست جمهوری پس از انتخاب مردم- صلاحیت داوطلبان ریاست
              جمهوری از جهت دارا بودن شرایطی كه در این قانون می‏‌آید، باید قبل
              از انتخابات به تأیید شورای نگهبان و در دوره اول به تأیید رهبری
              برسد.
              <br />
              ۱۰- عزل رئیس‌‏جمهور با در نظر گرفتن مصالح كشور پس از حكم دیوان
              عالی كشور به تخلف وی از وظایف قانونی، یا رأی مجلس شورای اسلامی به
              عدم كفایت وی بر اساس اصل هشتاد و نهم
              <br />
              ۱۱- عفو یا تخفیف مجازات محكومین در حدود موازین اسلامی پس از
              پیشنهاد رئیس قوه قضائیه.
              <br />
              رهبر می‏تواند بعضی از وظایف و اختیارات خود را به شخص دیگری تفویض
              كند.
              <br />
              <br />
              اصل یكصد و یازدهم
              <br />
              هرگاه رهبر از انجام وظایف قانونی خود ناتوان شود، یا فاقد یكی از
              شرایط مذكور در اصول پنجم و یكصد و نهم گردد، یا معلوم شود از آغاز
              فاقد بعضی از شرایط بوده است، از مقام خود بركنار خواهد شد. تشخیص
              این امر به عهده خبرگان مذكور در اصل یكصد و هشتم می‏‌باشد.
              <br />
              در صورت فوت یا كناره‏‌گیری یا عزل رهبر، خبرگان موظفند در اسرع وقت
              نسبت به تعیین و معرفی رهبر جدید اقدام نمایند. تا هنگام معرفی رهبر،
              شورایی مركب از رئیس جمهور، رئیس قوه قضائیه و یكی از فقهای شورای
              نگهبان به انتخاب مجمع تشخیص مصلحت نظام، همه وظایف رهبری را به طور
              موقت به عهده می‏‌گیرد و چنانچه در این مدت یكی از آنان به هر دلیل
              نتواند انجام وظیفه نماید، فرد دیگری به انتخاب مجمع، با حفظ اكثریت
              فقها در شورا، به جای وی منصوب می‏گردد. این شورا در خصوص وظایف
              بندهای (۱) و (۳) و (۵) و (۱۰) و قسمت‏های (د) و (ه‍‏) و (و) بند (۶)
              اصل یكصد و دهم، پس از تصویب سه‏‌چهارم اعضاء مجمع تشخیص مصلحت نظام
              اقدام می‏‌كند.
              <br />
              هرگاه رهبر بر اثر بیماری یا حادثه دیگری موقتاً از انجام وظایف
              رهبری ناتوان شود، در این مدت شورای مذكور در این اصل وظایف او را
              عهده‌‏دار خواهد بود.
              <br />
              <br />
              اصل یكصد و دوازدهم
              <br />
              مجمع تشخیص مصلحت نظام برای تشخیص مصحلت در مواردی كه مصوبه مجلس
              شورای اسلامی را شورای نگهبان خلاف موازین شرع و یا قانون اساسی
              بداند و مجلس با در نظر گرفتن مصلحت نظام، نظر شورای نگهبان را تأمین
              نكند و مشاوره در اموری كه رهبری به آنان ارجاع می‏دهد و سایر وظایفی
              كه در این قانون ذكر شده است به دستور رهبری تشكیل می‏شود. اعضاء
              ثابت و متغیر این مجمع را مقام رهبری تعیین می‏نماید. مقررات مربوط
              به مجمع توسط خود اعضاء تهیه و تصویب و به تأیید مقام رهبری خواهد
              رسید.
              <br />
              <br />
              <br />
            </div>
            <Grid
              sx={{
                display: "flex",
                justifyContent: "center",
                alignItems: "center",
              }}
            >
              <Typography
                variant="h4"
                sx={{
                  fontSize: 20,
                  fontFamily: "shabnam",
                  marginTop: "20px",
                  color: "blue",
                }}
              >
                فصل نهم - قوه مجریه
              </Typography>
            </Grid>
            <br />
            <br />
            مبحث اول- رياست جمهوری و وزرا
            <br />
            <br />
            اصل یکصد و سیزدهم
            <br />
            پس از مقام رهبری، رئیس جمهور عالی‏ترین مقام رسمی كشور است و مسئولیت
            اجرای قانون اساسی و ریاست قوه مجریه را جز در اموری كه مستقیماً به
            رهبری مربوط می‏شود، بر عهده دارد.
            <br />
            <br />
            اصل یكصد و چهاردهم
            <br />
            رئیس ‏جمهور برای مدت چهار سال با رأی مستقیم مردم انتخاب می‏شود و
            انتخاب مجدد او به صورت متوالی تنها برای یك دوره بلامانع است.
            <br />
            <br />
            اصل یكصد و پانزدهم
            <br />
            رئیس ‏جمهور باید از میان رجال مذهبی و سیاسی كه واجد شرایط زیر باشند
            انتخاب گردد:
            <br />
            ایرانی‌‏الاصل، تابع ایران، مدیر و مدبّر، دارای حُسن سابقه و امانت و
            تقوی، مؤمن و معتقد به مبانی جمهوری اسلامی ایران و مذهب رسمی كشور.
            <br />
            <br />
            اصل یكصد و شانزدهم
            <br />
            نامزدهای ریاست جمهوری باید قبل از شروع انتخابات آمادگی خود را رسماً
            اعلام كنند. نحوه برگزاری انتخاب رئیس ‏جمهوری را قانون معین می‏‌كند.
            <br />
            <br />
            اصل یكصد و هفدهم
            <br />
            رئیس ‏جمهور با اكثریت مطلق آراء شركت‌‏كنندگان، انتخاب می‏‌شود، ولی
            هرگاه در دور نخست هیچ‏یك از نامزد‏ها چنین اكثریتی بدست نیاورد، روز
            جمعه هفته بعد برای بار دوم رأی گرفته می‏شود. در دور دوم تنها دو نفر
            از نامزد‏ها كه در دور نخست آراء بیشتری داشته‌‏اند شركت می‏‌كنند، ولی
            اگر بعضی از نامزدهای دارنده آراء بیشتر، از شركت در انتخابات منصرف
            شوند، از میان بقیه، دو نفر كه در دور نخست بیش از دیگران رأی
            داشته‌‏اند برای انتخاب مجدد معرفی می‏‌شوند.
            <br />
            <br />
            اصل یكصد و هجدهم
            <br />
            مسئولیت نظارت بر انتخابات ریاست جمهوری طبق اصل نود و نهم بر عهده
            شورای نگهبان است، ولی قبل از تشكیل نخستین شورای نگهبان بر عهده انجمن
            نظارتی است كه قانون تعیین می‌‏كند.
            <br />
            <br />
            اصل یكصد و نوزدهم
            <br />
            انتخاب رئیس ‏جمهور جدید باید حداقل یك ماه پیش از پایان دوره ریاست
            جمهوری قبلی انجام شده باشد و در فاصله انتخاب رئیس ‏جمهور جدید و
            پایان دوره ریاست جمهوری سابق، رئیس‏ جمهور پیشین وظایف رئیس‏ جمهوری
            را انجام می‏دهد.
            <br />
            <br />
            اصل یكصد و بیستم
            <br />
            هرگاه در فاصله ده روز پیش از رأی‏‌گیری یكی از نامزدهایی كه صلاحیت او
            طبق این قانون احراز شده فوت كند، انتخابات به مدت دو هفته به تأخیر
            می‌‏افتد. اگر در فاصله دور نخست و دور دوم نیز یكی از دو نفر حائز
            اكثریت دور نخست فوت كند، مهلت انتخابات برای دو هفته تمدید می‏‌شود.
            <br />
            <br />
            اصل یكصد و بیست و یكم
            <br />
            رئیس جمهور در مجلس شورای اسلامی در جلسه‌‏ای كه با حضور رئیس قوه
            قضائیه و اعضای شورای نگهبان تشكیل می‌‏شود به ترتیب زیر سوگند یاد
            می‏‌كند و سوگندنامه را امضاء می‏‌نماید: «بسم ‏الله‏ الرحمن‏ الرحیم.
            من به عنوان رئیس‏ جمهور در پیشگاه قرآن كریم و در برابر ملت ایران به
            خداوند قادر متعال سوگند یاد می‏‌كنم كه پاسدار مذهب رسمی و نظام
            جمهوری اسلامی و قانون اساسی كشور باشم و همه استعداد و صلاحیت خویش را
            در راه ایفای مسئولیت‏هایی كه بر عهده گرفته‌‏ام به كار گیرم و خود را
            وقف خدمت به مردم و اعتلای كشور، ترویج دین و اخلاق، پشتیبانی از حق و
            گسترش عدالت سازم و از هرگونه خودكامگی بپرهیزم و از آزادی و حرمت
            اشخاص و حقوقی كه قانون اساسی برای ملت شناخته است حمایت كنم. در حراست
            از مرز‏ها و استقلال سیاسی و اقتصادی و فرهنگی كشور از هیچ اقدامی دریغ
            نورزم و با استعانت از خداوند و پیروی از پیامبر اسلام و ائمه اطهار
            علیهم‏السلام قدرتی را كه ملت به عنوان امانتی مقدس به من سپرده است
            همچون امینی پارسا و فداكار نگاهدار باشم و آن را به منتخب ملت پس از
            خود بسپارم.»
            <br />
            <br />
            اصل یكصد و بیست و دوم
            <br />
            رئیس‏ جمهور در حدود اختیارات‏ و وظایفی‏ که‏ به‏ موجب‏ قانون‏ اساسی‏
            و یا قوانین‏ عادی‏ به‏ عهده‏ دارد در برابر ملت‏ و رهبر و مجلس‏
            شورای‏ اسلامی‏ مسئول‏ است‏.
            <br />
            <br />
            اصل یكصد و بیست و سوم
            <br />
            رئیس جمهور موظف است مصوبات مجلس یا نتیجه همه‌‏پرسی را پس از طی مراحل
            قانونی و ابلاغ به وی امضاء كند و برای اجرا در اختیار مسئولان بگذارد.
            <br />
            <br />
            اصل یكصد و بیست و چهارم
            <br />
            رئیس ‏جمهور می‏تواند برای انجام وظایف قانونی خود معاونانی داشته
            باشد. معاون اول رئیس‏ جمهور با موافقت وی اداره هیئت وزیران و مسئولیت
            هماهنگی سایر معاونت‏ها را به عهده خواهد داشت.
            <br />
            <br />
            اصل یكصد و بیست و پنجم
            <br />
            امضای عهدنامه‏‌ها، مقاوله‏‌نامه‏‌ها، موافقتنامه‏‌ها و قراردادهای
            دولت ایران با سایر دولت‏ها و همچنین امضای پیمان‌های مربوط به
            اتحادیه‌های بین‏‌المللی پس از تصویب مجلس شورای اسلامی با رئیس جمهور
            یا نماینده قانونی او است.
            <br />
            <br />
            اصل یكصد و بیست و ششم
            <br />
            رئیس‏ جمهور مسئولیت امور برنامه و بودجه و امور اداری و استخدامی كشور
            را مستقیماً بر عهده دارد و می‏تواند اداره آنها را به عهده دیگری
            بگذارد.
            <br />
            <br />
            اصل یكصد و بیست و هفتم
            <br />
            رئیس‏ جمهور می‏تواند در موارد خاص، برحسب ضرورت با تصویب هیئت وزیران،
            نماینده یا نمایندگان ویژه با اختیارات مشخص تعیین نماید. در این موارد
            تصمیمات نماینده یا نمایندگان مذكور در حكم تصمیمات رئیس ‏جمهور و هیئت
            وزیران خواهد بود.
            <br />
            <br />
            اصل یكصد و بیست و هشتم
            <br />
            سفیران به پیشنهاد وزیر امور خارجه و تصویب رئیس ‏جمهور تعیین می‏شوند.
            رئیس ‏جمهور استوارنامه سفیران را امضاء می‏كند و استوارنامه سفیران
            كشورهای دیگر را می‏پذیرد.
            <br />
            <br />
            اصل یكصد و بیست و نهم
            <br />
            اعطای نشان‏های دولتی با رئیس ‏جمهور است.
            <br />
            <br />
            اصل یكصد و سی‌‏ام
            <br />
            رئیس جمهور استعفای خود را به رهبر تقدیم می‏‌كند و تا زمانی كه
            استعفای او پذیرفته نشده است به انجام وظایف خود ادامه می‏‌دهد.
            <br />
            <br />
            اصل یكصد و سی‏ و یكم
            <br />
            در صورت‏ فوت‏، عزل‏، استعفاء، غیبت‏ یا بیماری‏ بیش‏ از دو ماه‏ رئیس‏
            جمهور و یا در موردی‏ که‏ مدت‏ ریاست‏ جمهوری‏ پایان‏ یافته‏ و رئیس‏
            جمهور جدید بر اثر موانعی‏ هنوز انتخاب‏ نشده‏ و یا امور دیگری‏ از
            این‏ قبیل‏، معاون‏ اول‏ رئیس‏ جمهور با موافقت‏ رهبری،‏ اختیارات‏ و
            مسئولیتهای‏ وی‏ را بر عهده‏ می‏گیرد و شورایی‏ متشکل‏ از رئیس‏ مجلس‏
            و رئیس‏ قوه‏ قضائیه‏ و معاون‏ اول‏ رئیس‏ جمهور موظف‏ است‏ ترتیبی‏
            دهد که‏ حداکثر ظرف‏ مدت‏ پنجاه‏ روز رئیس‏ جمهور جدید انتخاب‏ شود. در
            صورت‏ فوت‏ معاون‏ اول‏ و یا امور دیگری‏ که‏ مانع انجام‏ وظایف‏ وی‏
            گردد و نیز در صورتی‏ که‏ رئیس‏ جمهور، معاون‏ اول‏ نداشته‏ باشد مقام‏
            رهبری‏ فرد دیگری‏ را به‏ جای‏ او منصوب‏ می‌‏کند.
            <br />
            <br />
            اصل یكصد و سی و دوم
            <br />
            در مدتی كه اختیارات و مسئولیت‏های رئیس‏ جمهور بر عهده معاون اول یا
            فرد دیگری است كه به موجب اصل یكصد و سی و یكم منصوب می‏‌گردد، وزرا را
            نمی‏توان استیضاح كرد یا به آنان رأی عدم اعتماد داد و نیز نمی‏توان
            برای تجدیدنظر در قانون اساسی و یا امر همه‌‏پرسی اقدام نمود.
            <br />
            <br />
            اصل یكصد و سی و سوم
            <br />
            وزرا توسط رئیس‏ جمهور تعیین‏ و برای‏ گرفتن‏ رأی‏ اعتماد به‏ مجلس‏
            معرفی‏ می‌‏شوند. با تغییر مجلس‏، گرفتن‏ رأی‏ اعتماد جدید برای‏ وزرا
            لازم‏ نیست‏. تعداد وزیران‏ و حدود اختیارات‏ هر یک‏ از آنان‏ را
            قانون‏ معین‏ می‏‌کند.
            <br />
            <br />
            اصل یكصد و سی و چهارم
            <br />
            ریاست هیئت وزیران با رئیس ‏جمهور است كه بر كار وزیران نظارت دارد و
            با اتخاذ تدابیر لازم به هماهنگ ساختن تصمیم‏های وزیران و هیئت دولت
            می‏‌پردازد و با همكاری وزیران، برنامه و خط مشی دولت را تعیین و
            قوانین را اجرا می‏‌كند.
            <br />
            در موارد اختلاف نظر و یا تداخل در وظایف قانونی دستگا‏ه‏های دولتی در
            صورتی كه نیاز به تفسیر یا تغییر قانون نداشته باشد، تصمیم هیئت وزیران
            كه به پیشنهاد رئیس ‏جمهور اتخاذ می‏شود لازم‏‌الاجراء است.
            <br />
            رئیس ‏جمهور در برابر مجلس، مسئول اقدامات هیئت وزیران است.
            <br />
            <br />
            اصل یكصد و سی و پنجم
            <br />
            وزرا تا زمانی كه عزل نشده‌‏اند و یا بر اثر استیضاح یا درخواست رأی
            اعتماد، مجلس به آنها رأی عدم اعتماد نداده است در سِمَت خود باقی
            می‏‌مانند. استعفای هیئت وزیران یا هر یك از آنان به رئیس ‏جمهور تسلیم
            می‏‌شود و هیئت وزیران تا تعیین دولت جدید به وظایف خود ادامه خواهند
            داد. رئیس‏ جمهور می‏تواند برای وزارتخانه‏‌هایی كه وزیر ندارند حداكثر
            برای مدت سه ماه سرپرست تعیین نماید.
            <br />
            <br />
            اصل يكصد و سی و ششم
            <br />
            رئيس ‌جمهور مي‌تواند وزرا را عزل كند و در اين صورت بايد براي وزير يا
            وزيران جديد از مجلس رأي اعتماد بگيرد، و در صورتی كه پس از ابراز
            اعتماد مجلس به دولت نيمی از هيئت وزيران تغيير نمايد بايد مجدداً از
            مجلس شورای اسلامی برای هيئت وزيران تقاضای رأی اعتماد كند.
            <br />
            <br />
            اصل یكصد و سی و هفتم
            <br />
            هر یك از وزیران، مسئول وظایف خاص خویش در برابر رئیس ‏جمهور و مجلس
            است و در اموری كه به تصویب هیئت وزیران می‏‌رسد مسئول اعمال دیگران
            نیز هست.
            <br />
            <br />
            اصل یكصد و سی و هشتم
            <br />
            علاوه بر مواردی كه هیئت وزیران یا وزیری مأمور تدوین آیین‏‌نامه‏‌های
            اجرایی قوانین می‌‏شود، هیئت وزیران حق دارد برای انجام وظایف اداری و
            تأمین اجرای قوانین و تنظیم سازمان‏های اداری به وضع تصویب‏‌نامه و
            آیین‏‌نامه بپردازد. هر یك از وزیران نیز در حدود وظایف خویش و مصوبات
            هیئت وزیران حق وضع آیین‏‌نامه و صدور بخشنامه را دارد، ولی مفاد این
            مقررات نباید با متن و روح قوانین مخالف باشد. دولت می‏تواند تصویب
            برخی از امور مربوط به وظایف خود را به كمیسیون‏های متشكل از چند وزیر
            واگذار نماید. مصوبات این كمیسیون‏ها در محدوده قوانین پس از تأیید
            رئیس جمهور لازم‌‏الاجرا است. تصویب‏‌نامه‏‌ها و آیین‏‌نامه‏‌های دولت
            و مصوبات كمیسیون‏های مذكور در این اصل‏، ضمن ابلاغ برای اجرا به اطلاع
            رئیس مجلس شورای اسلامی می‏‌رسد تا در صورتی كه آنها را برخلاف قوانین
            بیابد با ذكر دلیل برای تجدیدنظر به هیئت وزیران بفرستد.
            <br />
            <br />
            اصل یكصد و سی و نهم
            <br />
            صلح دعاوی راجع به اموال عمومی و دولتی یا ارجاع آن به داوری در هر
            مورد، موكول به تصویب هیئت وزیران است و باید به اطلاع مجلس برسد. در
            مواردی كه طرف دعوی خارجی باشد و در موارد مهم داخلی باید به تصویب
            مجلس نیز برسد. موارد مهم را قانون تعیین می‏‌كند.
            <br />
            <br />
            اصل یكصد و چهلم
            <br />
            رسیدگی به اتهام رئیس ‏جمهور و معاونان او و وزیران در مورد جرایم عادی
            با اطلاع مجلس شورای اسلامی در دادگاه‏های عمومی دادگستری انجام
            می‏‌شود.
            <br />
            <br />
            اصل یكصد و چهل و یكم
            <br />
            رئیس جمهور، معاونان رئیس جمهور، وزیران و كارمندان دولت نمی‌‏توانند
            بیش از یك شغل دولتی داشته باشند و داشتن هر نوع شغل دیگر در مؤسساتی
            كه تمام یا قسمتی از سرمایه آن متعلق به دولت یا مؤسسات عمومی است و
            نمایندگی مجلس شورای اسلامی و وكالت دادگستری و مشاوره حقوقی و نیز
            ریاست و مدیریت عامل یا عضویت در هیئت مدیره انواع مختلف شركت‏های
            خصوصی، جز شركت‏های تعاونی ادارات و مؤسسات برای آنان ممنوع است.
            سِمَت‏های آموزشی در دانشگاه‏ها و مؤسسات تحقیقاتی از این حكم مستثنی
            است.
            <br />
            <br />
            اصل یكصد و چهل و دوم
            <br />
            دارایی رهبر، رئیس ‏جمهور، معاونان رئیس ‏جمهور، وزیران و همسر و
            فرزندان آنان قبل و بعد از خدمت، توسط رئیس قوه قضائیه رسیدگی می‏شود
            كه بر خلاف حق افزایش نیافته باشد.
            <br />
            <br />
            مبحث دوم- ارتش و سپاه پاسداران انقلاب
            <br />
            <br />
            اصل یكصد و چهل و سوم
            <br />
            ارتش جمهوری اسلامی ایران پاسداری از استقلال و تمامیت ارضی و نظام
            جمهوری اسلامی كشور را بر عهده دارد.
            <br />
            <br />
            اصل یكصد و چهل و چهارم
            <br />
            ارتش جمهوری اسلامی ایران باید ارتشی اسلامی باشد كه ارتشی مكتبی و
            مردمی است و باید افرادی شایسته را به خدمت بپذیرد كه به اهداف انقلاب
            اسلامی مؤمن و در راه تحقق آن فداكار باشند.
            <br />
            <br />
            اصل یكصد و چهل و پنجم
            <br />
            هیچ فرد خارجی به عضویت در ارتش و نیروهای انتظامی كشور پذیرفته
            نمی‏‌شود.
            <br />
            <br />
            اصل یكصد و چهل و ششم
            <br />
            استقرار هرگونه پایگاه نظامی خارجی در كشور هر چند به عنوان
            استفاده‏های صلح‌‏آمیز باشد ممنوع است.
            <br />
            <br />
            اصل یكصد و چهل و هفتم
            <br />
            دولت باید در زمان صلح از افراد و تجهیزات فنی ارتش در كارهای امدادی،
            آموزشی، تولیدی و جهاد سازندگی، با رعایت كامل موازین عدل اسلامی
            استفاده كند در حدّی كه به آمادگی رزمی ارتش آسیبی وارد نیاید.
            <br />
            <br />
            اصل یكصد و چهل و هشتم
            <br />
            هر نوع بهره‌‏برداری شخصی از وسایل و امكانات ارتش و استفاده شخصی از
            افراد آنها به صورت گماشته، راننده شخصی و نظایر اینها ممنوع است.
            <br />
            <br />
            اصل یكصد و چهل و نهم
            <br />
            ترفیع درجه نظامیان و سلب آن به موجب قانون است.
            <br />
            <br />
            اصل یكصد و پنجاهم
            <br />
            سپاه پاسداران انقلاب اسلامی كه در نخستین روزهای پیروزی این انقلاب
            تشكیل شد، برای ادامه نقش خود در نگهبانی از انقلاب و دستاوردهای آن
            پابرجا می‏‌ماند. حدود وظایف و قلمرو مسئولیت این سپاه در رابطه با
            وظایف و قلمرو مسئولیت نیروهای مسلح دیگر با تأكید بر همكاری و هماهنگی
            برادرانه میان آنها به‏‌وسیله قانون تعیین می‌‏شود.
            <br />
            <br />
            اصل یكصد و پنجاه و یكم
            <br />
            به حكم آیه كریمه (وَ أعِدُّوا لَهُمْ مَا اسْتَطَعْتُمْ مِنْ قُوَّةٍ
            وَ مِنْ رِباطِ الْخَیلِ تُرْهِبُونَ بِهِ عَدُوَّ اللَّهِ وَ
            عَدُوَّكُمْ وَ آخَرینَ مِنْ دُونِهِمْ لا تَعْلَمُونَهُمُ اللَّهُ
            یعْلَمُهُمْ) دولت موظف است برای همه افراد كشور برنامه و امكانات
            آموزش نظامی را بر طبق موازین اسلامی فراهم نماید، به طوری كه همه
            افراد همواره توانایی دفاع مسلحانه از كشور و نظام جمهوری اسلامی ایران
            را داشته باشند، ولی داشتن اسلحه باید با اجازه مقامات رسمی باشد.
            <br />
            <br />
            <br />
            <Grid
              sx={{
                display: "flex",
                justifyContent: "center",
                alignItems: "center",
              }}
            >
              <Typography
                variant="h4"
                sx={{
                  fontSize: 20,
                  fontFamily: "shabnam",
                  marginTop: "20px",
                  color: "blue",
                }}
              >
                فصل دهم - سیاست خارجی
              </Typography>
            </Grid>
            <br />
            <br />
            اصل یكصد و پنجاه و دوم
            <br />
            سیاست خارجی جمهوری اسلامی ایران بر اساس نفی هرگونه سلطه‏‌جویی و
            سلطه‏‌پذیری، حفظ استقلال همه‏‌جانبه و تمامیت ارضی كشور، دفاع از حقوق
            همه مسلمانان و عدم تعهد در برابر قدرت‏های سلطه‏‌گر و روابط صلح‏‌آمیز
            متقابل با دول غیرمحارب استوار است.
            <br />
            <br />
            اصل یكصد و پنجاه و سوم
            <br />
            هرگونه قرارداد كه موجب سلطه بیگانه بر منابع طبیعی و اقتصادی، فرهنگ،
            ارتش و دیگر شئون كشور گردد ممنوع است.
            <br />
            <br />
            اصل یكصد و پنجاه و چهارم
            <br />
            جمهوری اسلامی ایران سعادت انسان در كل جامعه بشری را آرمان خود
            می‏داند و استقلال و آزادی و حكومت حق و عدل را حق همه مردم جهان
            می‏‌شناسد. بنابراین در عین خودداری كامل از هرگونه دخالت در امور
            داخلی ملت‏های دیگر، از مبارزه حق‌‏طلبانه مستضعفین در برابر مستكبرین
            در هر نقطه از جهان حمایت می‌‏كند.
            <br />
            <br />
            اصل یكصد و پنجاه و پنجم
            <br />
            دولت جمهوری اسلامی ایران می‌‏تواند به كسانی كه پناهندگی سیاسی
            بخواهند پناه دهد مگر این كه بر طبق قوانین ایران خائن و تبهكار شناخته
            شوند.
            <br />
            <br />
            <br />
            <Grid
              sx={{
                display: "flex",
                justifyContent: "center",
                alignItems: "center",
              }}
            >
              <Typography
                variant="h4"
                sx={{
                  fontSize: 20,
                  fontFamily: "shabnam",
                  marginTop: "20px",
                  color: "blue",
                }}
              >
                فصل یازدهم - قوه قضائیه
              </Typography>
            </Grid>
            <br />
            <br />
            اصل یكصد و پنجاه و ششم
            <br />
            قوه‌قضائیه قوه‌‏ای است مستقل كه پشتیبان حقوق فردی و اجتماعی و مسئول
            تحقق بخشیدن به عدالت و عهده‌‏دار وظایف زیر است:
            <br />
            ۱- رسیدگی و صدور حكم در مورد تظلّمات، تعدّیات، شكایات، حل و فصل
            دعاوی و رفع خصومات و اخذ تصمیم و اقدام لازم در آن قسمت از امور حسبیه
            كه قانون معین می‌‏كند.
            <br />
            ۲- احیای حقوق عامه و گسترش عدل و آزادی‏های مشروع
            <br />
            ۳- نظارت بر حُسن اجرای قوانین
            <br />
            ۴- كشف جرم و تعقیب و مجازات و تعزیر مجرمین و اجرای حدود و مقررات
            مدوّن جزائی اسلام
            <br />
            ۵- اقدام مناسب برای پیشگیری از وقوع جرم و اصلاح مجرمین.
            <br />
            <br />
            اصل یكصد و پنجاه و هفتم
            <br />
            به منظور انجام مسئولیت‏های قوه قضائیه در كلیه امور قضایی و اداری و
            اجرایی، مقام رهبری یك نفر مجتهد عادل و آگاه به امور قضایی و مدیر و
            مدبر را برای مدت پنج سال به عنوان رئیس قوه قضائیه تعیین می‌‏نماید كه
            عالی‏ترین مقام قوه قضائیه است.
            <br />
            <br />
            اصل یكصد و پنجاه و هشتم
            <br />
            وظایف رئیس قوه قضائیه به شرح زیر است:
            <br />
            ۱- ایجاد تشكیلات لازم در دادگستری به تناسب مسئولیت‏های اصل یكصد و
            پنجاه و ششم
            <br />
            ۲- تهیه لوایح قضایی متناسب با جمهوری اسلامی
            <br />
            ۳- استخدام قضات عادل و شایسته و عزل و نصب آنها و تغییر محل مأموریت و
            تعیین مشاغل و ترفیع آنان و مانند اینها از امور اداری، طبق قانون.
            <br />
            <br />
            اصل یكصد و پنجاه و نهم
            <br />
            مرجع رسمی تظلّمات و شكایات، دادگستری است. تشكیل دادگاه‏ها و تعیین
            صلاحیت آنها منوط به حكم قانون است.
            <br />
            <br />
            اصل یكصد و شصتم
            <br />
            وزیر دادگستری مسئولیت كلیه مسائل مربوطه به روابط قوه قضائیه با قوه
            مجریه و قوه مقننه را بر عهده دارد و از میان كسانی كه رئیس قوه قضائیه
            به رئیس جمهور پیشنهاد می‏‌كند انتخاب می‏‌گردد.
            <br />
            رئیس قوه قضائیه می‏تواند اختیارات تامّ مالی و اداری و نیز اختیارات
            استخدامی غیر قضات را به وزیر دادگستری تفویض كند. در این صورت وزیر
            دادگستری دارای همان اختیارات و وظایفی خواهد بود كه در قوانین برای
            وزرا به عنوان عالی‏ترین مقام اجرایی پیش‏بینی می‌‏شود.
            <br />
            <br />
            اصل یكصد و شصت و یكم
            <br />
            دیوان عالی كشور به منظور نظارت بر اجرای صحیح قوانین در محاكم و ایجاد
            وحدت رویه قضایی و انجام مسئولیت‏هایی كه طبق قانون به آن محول می‏شود
            بر اساس ضوابطی كه رئیس قوه قضائیه تعیین می‏كند تشكیل می‏‌گردد.
            <br />
            <br />
            اصل یكصد و شصت و دوم
            <br />
            رئیس دیوان عالی كشور و دادستان كل باید مجتهد عادل و آگاه به امور
            قضایی باشند و رئیس قوه قضائیه با مشورت قضات دیوان عالی كشور آنها را
            برای مدت پنج سال به این سِمَت منصوب می‏‌كند.
            <br />
            <br />
            اصل یكصد و شصت و سوم
            <br />
            صفات و شرایط قاضی طبق موازین فقهی به وسیله قانون معین می‌‏شود.
            <br />
            <br />
            اصل یكصد و شصت و چهارم
            <br />
            قاضی را نمی‏توان از مقامی كه شاغل آن است بدون محاكمه و ثبوت جرم یا
            تخلفی كه موجب انفصال است به طور موقت یا دائم منفصل كرد یا بدون رضای
            او محل خدمت یا سِمَتش را تغییر داد مگر به اقتضای مصلحت جامعه با
            تصمیم رئیس قوه قضائیه پس از مشورت با رئیس دیوان عالی كشور و دادستان
            كل. نقل و انتقال دوره‏ای قضات بر طبق ضوابط كلّی كه قانون تعیین
            می‏كند صورت می‏‌گیرد.
            <br />
            <br />
            اصل یكصد و شصت و پنجم
            <br />
            محاكمات، علنی انجام می‌‏شود و حضور افراد بلامانع است مگر آنكه به
            تشخیص دادگاه، علنی بودن آن منافی عفت عمومی یا نظم عمومی باشد یا در
            دعاوی خصوصی طرفین دعوا تقاضا كنند كه محاكمه علنی نباشد.
            <br />
            <br />
            اصل یكصد و شصت و ششم
            <br />
            احكام دادگاه‏ها باید مستدلّ و مستند به مواد قانون و اصولی باشد كه بر
            اساس آن حكم صادر شده است.
            <br />
            <br />
            اصل یكصد و شصت و هفتم
            <br />
            قاضی موظف است كوشش كند حكم هر دعوا را در قوانین مدوّنه بیابد و اگر
            نیابد با استناد به منابع معتبر اسلامی یا فتاوی معتبر، حكم قضیه را
            صادر نماید و نمی‏‌تواند به بهانه سكوت یا نقص یا اجمال یا تعارض
            قوانین مدوّنه از رسیدگی به دعوا و صدور حكم امتناع ورزد.
            <br />
            <br />
            اصل یكصد و شصت و هشتم
            <br />
            رسیدگی به جرایم سیاسی و مطبوعاتی علنی است و با حضور هیئت منصفه در
            محاكم دادگستری صورت می‏‌گیرد. نحوه انتخاب، شرایط، اختیارات هیئت
            منصفه و تعریف جرم سیاسی را قانون بر اساس موازین اسلامی معین می‌‏كند.
            <br />
            <br />
            اصل یكصد و شصت و نهم
            <br />
            هیچ فعلی یا ترك فعلی به استناد قانونی كه بعد از آن وضع شده است جرم
            محسوب نمی‏‌شود.
            <br />
            <br />
            اصل یكصد و هفتادم
            <br />
            قضات دادگاه‏ها مكلفند از اجرای تصویب‏‌نامه‌‏ها و آیین‏‌نامه‏‌های
            دولتی كه مخالف با قوانین و مقررات اسلامی یا خارج از حدود اختیارات
            قوه مجریه است خودداری كنند و هر كس می‏تواند ابطال این‏گونه مقررات را
            از دیوان عدالت اداری تقاضا كند.
            <br />
            <br />
            اصل یكصد و هفتاد و یكم
            <br />
            هرگاه در اثر تقصیر یا اشتباه قاضی در موضوع یا در حكم یا در تطبیق حكم
            بر مورد خاص، ضرر مادی یا معنوی متوجه كسی گردد، در صورت تقصیر، مقصر
            طبق موازین اسلامی ضامن است و در غیر این صورت خسارت به‌‏وسیله دولت
            جبران می‏شود، و در هر حال از متهم اعاده حیثیت می‌‏گردد.
            <br />
            <br />
            اصل یكصد و هفتاد و دوم
            <br />
            برای رسیدگی به جرایم مربوط به وظایف خاص نظامی یا انتظامی اعضای ارتش،
            ژاندارمری، شهربانی و سپاه پاسداران انقلاب اسلامی، محاكم نظامی مطابق
            قانون تشكیل می‌‏گردد، ولی به جرایم عمومی آنان یا جرایمی كه در مقام
            ضابط دادگستری مرتكب شوند در محاكم عمومی رسیدگی می‏‌شود.
            <br />
            دادستانی و دادگاه‏های نظامی، بخشی از قوه قضائیه كشور و مشمول اصول
            مربوط به این قوه هستند.
            <br />
            <br />
            اصل یكصد و هفتاد و سوم
            <br />
            به منظور رسیدگی به شكایات، تظلّمات و اعتراضات مردم نسبت به مأمورین
            یا واحد‏ها یا آیین‏‌نامه‏‌های دولتی و احقاق حقوق آنها، دیوانی به نام
            «دیوان عدالت اداری» زیر نظر رئیس قوه قضائیه تأسیس می‌‏گردد. حدود
            اختیارات و نحوه عمل این دیوان را قانون تعیین می‏‌كند.
            <br />
            <br />
            اصل یكصد و هفتاد و چهارم
            <br />
            بر اساس حق نظارت قوه قضائیه نسبت به حُسن جریان امور و اجرای صحیح
            قوانین در دستگاه‏های اداری، سازمانی به نام «سازمان بازرسی كل كشور»
            زیر نظر رئیس قوه قضائیه تشكیل می‏‌گردد. حدود اختیارات و وظایف این
            سازمان را قانون تعیین می‏‌كند.
            <br />
            <br />
            <br />
            <Grid
              sx={{
                display: "flex",
                justifyContent: "center",
                alignItems: "center",
              }}
            >
              <Typography
                variant="h4"
                sx={{
                  fontSize: 20,
                  fontFamily: "shabnam",
                  marginTop: "20px",
                  color: "blue",
                }}
              >
                فصل دوازدهم - صدا و سیما
              </Typography>
            </Grid>
            <br />
            <br />
            اصل یكصد و هفتاد و پنجم
            <br />
            در صدا و سیمای جمهوری اسلامی ایران، آزادی بیان و نشر افكار با رعایت
            موازین اسلامی و مصالح كشور باید تأمین گردد.
            <br />
            نصب و عزل رئیس سازمان صدا و سیمای جمهوری اسلامی ایران با مقام رهبری
            است و شورایی مركب از نمایندگان رئیس جمهور و رئیس قوه قضائیه و مجلس
            شورای اسلامی (هركدام دو نفر) نظارت بر این سازمان خواهند داشت.
            <br />
            خط مشی و ترتیب اداره سازمان و نظارت بر آن را قانون معین می‏كند.
            <br />
            <br />
            <br />
            <Grid
              sx={{
                display: "flex",
                justifyContent: "center",
                alignItems: "center",
              }}
            >
              <Typography
                variant="h4"
                sx={{
                  fontSize: 20,
                  fontFamily: "shabnam",
                  marginTop: "20px",
                  color: "blue",
                }}
              >
                فصل سیزدهم - شورای عالی امنیت ملی
              </Typography>
            </Grid>
            <br />
            <br />
            اصل یكصد و هفتاد و ششم
            <br />
            به منظور تأمین منافع ملی و پاسداری از انقلاب اسلامی و تمامیت ارضی و
            حاكمیت ملی، «شورای عالی امنیت ملی» به ریاست رئیس جمهور، با وظایف زیر
            تشكیل می‌‏گردد:
            <br />
            ۱- تعیین سیاست‏های دفاعی- امنیتی كشور در محدوده سیاست‏های كلّی
            تعیین‌‏شده از طرف مقام رهبری
            <br />
            ۲- هماهنگ نمودن فعالیت‏های سیاسی، اطلاعاتی، اجتماعی، فرهنگی و
            اقتصادی در ارتباط با تدابیر كلّی دفاعی- امنیتی
            <br />
            ۳- بهره‏‌گیری از امكانات مادی و معنوی كشور برای مقابله با تهدیدهای
            داخلی و خارجی.
            <br />
            اعضای شورا عبارتند از:
            <br />
            - رؤسای قوای سه‏‌گانه
            <br />
            - رئیس ستاد فرماندهی كلّ نیروهای مسلح
            <br />
            - مسئول امور برنامه و بودجه
            <br />
            - دو نماینده به انتخاب مقام رهبری
            <br />
            - وزرای امور خارجه، كشور، اطلاعات
            <br />
            - حسب مورد وزیر مربوط و عالی‏ترین مقام ارتش و سپاه
            <br />
            شورای عالی امنیت ملی به تناسب وظایف خود شوراهای فرعی از قبیل شورای
            دفاع و شورای امنیت كشور تشكیل می‌‏دهد. ریاست هر یك از شوراهای فرعی
            با رئیس جمهور یا یكی از اعضای شورای عالی است كه از طرف رئیس جمهور
            تعیین می‌‏شود.
            <br />
            حدود اختیارات و وظایف شوراهای فرعی را قانون معین می‏‌كند و تشكیلات
            آنها به تصویب شورای عالی می‌‏رسد.
            <br />
            مصوبات شورای عالی امنیت ملی پس از تأیید مقام رهبری قابل اجرا است.
            <br />
            <br />
            <br />
            <Grid
              sx={{
                display: "flex",
                justifyContent: "center",
                alignItems: "center",
              }}
            >
              <Typography
                variant="h4"
                sx={{
                  fontSize: 20,
                  fontFamily: "shabnam",
                  marginTop: "20px",
                  color: "blue",
                }}
              >
                فصل چهاردهم - بازنگری در قانون اساسی
              </Typography>
            </Grid>
            <br />
            <br />
            اصل یكصد و هفتاد و هفتم
            <br />
            بازنگری در قانون اساسی جمهوری اسلامی ایران، در موارد ضروری به ترتیب
            زیر انجام می‏گیرد:
            <br />
            مقام رهبری پس از مشورت با مجمع تشخیص مصلحت نظام طی حكمی خطاب به رئیس
            جمهور موارد اصلاح یا تتمیم قانون اساسی را به شورای بازنگری قانون
            اساسی با تركیب زیر پیشنهاد می‏‌نماید:
            <br />
            ۱- اعضای شورای نگهبان
            <br />
            ۲- رؤسای قوای سه‏‌گانه
            <br />
            ۳- اعضای ثابت مجمع تشخیص مصلحت نظام
            <br />
            ۴- پنج نفر از اعضای مجلس خبرگان رهبری
            <br />
            ۵- ده نفر به انتخاب مقام رهبری
            <br />
            ۶- سه نفر از هیئت وزیران
            <br />
            ۷- سه نفر از قوه قضائیه
            <br />
            ۸- ده نفر از نمایندگان مجلس شورای اسلامی
            <br />
            ۹- سه نفر از دانشگاهیان.
            <br />
            شیوه كار و كیفیت انتخاب و شرایط آن را قانون معین می‌‏كند.
            <br />
            مصوبات شورا پس از تأیید و امضای مقام رهبری باید از طریق مراجعه به
            آراء عمومی به تصویب اكثریت مطلق شركت‏كنندگان در همه‌‏پرسی برسد.
            <br />
            رعایت ذیل اصل پنجاه و نهم در مورد همه‏‌پرسی «بازنگری در قانون اساسی»
            لازم نیست.
            <br />
            محتوای اصول مربوط به اسلامی بودن نظام و ابتنای كلیه قوانین و مقررات
            بر اساس موازین اسلامی و پایه‏‌های ایمانی و اهداف جمهوری اسلامی ایران
            و جمهوری بودن حكومت و ولایت امر و امامت امت و نیز اداره امور كشور با
            اتكاء به آراء عمومی و دین و مذهب رسمی ایران تغییرناپذیر است.
            <br />
          </Typography>
        </Grid>
      </Grid>
    </>
  );
};

export default AsasiLaw;
