import React from 'react';
import { Link } from "react-router-dom";

const Policy = () => {
  return (
    <div>
      <h1>قوانین وکیل پرس</h1>
      <p>
        کاربر تعهد میدهد تمام اطلاعاتی که در این سایت وارد کرده است، واقعی بوده و عواقب هرگونه اسم جعل یا هویت جعلی برعهد وی است.
      </p>
      <p>
       وکلا تعهد می دهند، از اطلاعات موکلان صیانت نمایند.
      </p>
      <p>
        وکلا تعهد می دهند از هرگونه راهنمایی انحرافی خودداری نمایند
      </p>
      <p>
      کاربر تعهد میدهد، برای حقوق وکیل احترام قائل باشد. و در صورت استفاده از مطلب وکیل حتما نام وکیل را قید نماید.
      </p>
      <Link to="/Register">بازگشت</Link>
    </div>
  );
};

export default Policy;
